
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>11.哈希算法 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-auto-scroll-table/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="二叉树.html" />
    
    
    <link rel="prev" href="散列表.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    书籍介绍
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">入门篇</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    入门篇
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="Array.html">
            
                <a href="Array.html">
            
                    
                    02. 数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="LinkList.html">
            
                <a href="LinkList.html">
            
                    
                    03. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="递归.html">
            
                <a href="递归.html">
            
                    
                    04. 递归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="Stack.html">
            
                <a href="Stack.html">
            
                    
                    05. 栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="queue.html">
            
                <a href="queue.html">
            
                    
                    06. 队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="sort.html">
            
                <a href="sort.html">
            
                    
                    07. 排序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="二分查找.html">
            
                <a href="二分查找.html">
            
                    
                    08. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.8" data-path="跳表.html">
            
                <a href="跳表.html">
            
                    
                    09.跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.9" data-path="散列表.html">
            
                <a href="散列表.html">
            
                    
                    10.散列表
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.10" data-path="哈希算法.html">
            
                <a href="哈希算法.html">
            
                    
                    11.哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.11" data-path="二叉树.html">
            
                <a href="二叉树.html">
            
                    
                    12.二叉树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.12" data-path="红黑树.md">
            
                <span>
            
                    
                    13.红黑树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.13" data-path="二叉堆.html">
            
                <a href="二叉堆.html">
            
                    
                    14.二叉堆与优先队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.14" data-path="图.html">
            
                <a href="图.html">
            
                    
                    15.图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.15" data-path="DFS and BFS.html">
            
                <a href="DFS and BFS.html">
            
                    
                    16.深度优先遍历 和 广度优先遍历
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >11.哈希算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;">&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;</h1>
<p>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x662F;&#x6307;&#x5C06;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x503C;&#x4E32;&#x6620;&#x5C04;&#x4E3A;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x503C;&#x4E32;&#xFF0C;&#x8FD9;&#x4E2A;&#x6620;&#x5C04;&#x7684;&#x89C4;&#x5219;&#x5C31;&#x662F;<strong>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;</strong>&#xFF0C;&#x800C;&#x901A;&#x8FC7;&#x539F;&#x59CB;&#x6570;&#x636E;&#x6620;&#x5C04;&#x4E4B;&#x540E;&#x5F97;&#x5230;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x503C;&#x4E32;&#x5C31;&#x662F;<strong>&#x54C8;&#x5E0C;&#x503C;</strong>&#x3002;</p>
<p>&#x8981;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x51E0;&#x70B9;&#x8981;&#x6C42;&#xFF1A;</p>
<ul>
<li>&#x4ECE;&#x54C8;&#x5E0C;&#x503C;&#x4E0D;&#x80FD;&#x53CD;&#x5411;&#x63A8;&#x5BFC;&#x51FA;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF08;&#x6240;&#x4EE5;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x4E5F;&#x53EB;&#x5355;&#x5411;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF09;&#xFF1B;</li>
<li>&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x975E;&#x5E38;&#x654F;&#x611F;&#xFF0C;&#x54EA;&#x6015;&#x539F;&#x59CB;&#x6570;&#x636E;&#x53EA;&#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E2A; Bit&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E5F;&#x5927;&#x4E0D;&#x76F8;&#x540C;&#xFF1B;</li>
<li>&#x6563;&#x5217;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x8981;&#x5F88;&#x5C0F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF0C;&#x54C8;&#x5E0C;&#x503C;&#x76F8;&#x540C;&#x7684;&#x6982;&#x7387;&#x975E;&#x5E38;&#x5C0F;&#xFF1B;</li>
<li>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x8981;&#x5C3D;&#x91CF;&#x9AD8;&#x6548;&#xFF0C;&#x9488;&#x5BF9;&#x8F83;&#x957F;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x4E5F;&#x80FD;&#x5FEB;&#x901F;&#x5730;&#x8BA1;&#x7B97;&#x51FA;&#x54C8;&#x5E0C;&#x503C;&#x3002;</li>
</ul>
<p>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8981;&#x5904;&#x7406;&#x7684;&#x6587;&#x672C;&#x53EF;&#x80FD;&#x662F;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x975E;&#x5E38;&#x957F;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5982;&#x679C;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x5F88;&#x957F;&#xFF0C;&#x90A3;&#x5C31;&#x53EA;&#x80FD;&#x505C;&#x7559;&#x5728;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#x7684;&#x5C42;&#x9762;&#xFF0C;&#x5F88;&#x96BE;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x4ECA;&#x5929;&#x4E00;&#x7BC7;&#x5305;&#x542B; 4000 &#x591A;&#x4E2A;&#x6C49;&#x5B57;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x7528; MD5 &#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x7528;&#x4E0D;&#x4E86; 1ms &#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<h1 id="&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5E94;&#x7528;">&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5E94;&#x7528;</h1>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5E94;&#x7528;&#x5206;&#x522B;&#x662F;<strong>&#x5B89;&#x5168;&#x52A0;&#x5BC6;&#x3001;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3001;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x3001;&#x6563;&#x5217;&#x51FD;&#x6570;</strong>&#x3002;</p>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x6709;<strong>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3001;&#x6570;&#x636E;&#x5206;&#x7247;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;</strong>&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x4E00;&#x5B89;&#x5168;&#x52A0;&#x5BC6;">&#x5E94;&#x7528;&#x4E00;:&#x5B89;&#x5168;&#x52A0;&#x5BC6;</h1>
<p>&#x6700;&#x5E38;&#x7528;&#x4E8E;&#x52A0;&#x5BC6;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x662F;<strong>MD5</strong>&#xFF08;MD5 Message-Digest Algorithm&#xFF0C;MD5 &#x6D88;&#x606F;&#x6458;&#x8981;&#x7B97;&#x6CD5;&#xFF09;&#x3001;<strong>SHA</strong>&#xFF08;Secure Hash Algorithm&#xFF0C;&#x5B89;&#x5168;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#xFF09;&#x3001;<strong>DES</strong>&#xFF08;Data Encryption Standard&#xFF0C;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x6807;&#x51C6;&#xFF09;&#x3001;<strong>AES</strong>&#xFF08;Advanced Encryption Standard&#xFF0C;&#x9AD8;&#x7EA7;&#x52A0;&#x5BC6;&#x6807;&#x51C6;&#xFF09;&#x3002;</p>
<p><strong>&#x4E3A;&#x4EC0;&#x4E48;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x96F6;&#x51B2;&#x7A81;&#xFF1F;</strong></p>
<p>&#x9E3D;&#x5DE2;&#x539F;&#x7406;&#xFF08;&#x4E5F;&#x53EB;&#x62BD;&#x5C49;&#x539F;&#x7406;&#xFF09;&#x662F;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6709; 10 &#x4E2A;&#x9E3D;&#x5DE2;&#xFF0C;&#x6709; 11 &#x53EA;&#x9E3D;&#x5B50;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x6709; 1 &#x4E2A;&#x9E3D;&#x5DE2;&#x4E2D;&#x7684;&#x9E3D;&#x5B50;&#x6570;&#x91CF;&#x591A;&#x4E8E; 1 &#x4E2A;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x80AF;&#x5B9A;&#x6709; 2 &#x53EA;&#x9E3D;&#x5B50;&#x5728; 1 &#x4E2A;&#x9E3D;&#x5DE2;&#x5185;&#x3002;</p>
<p>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x4EA7;&#x751F;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x957F;&#x5EA6;&#x662F;&#x56FA;&#x5B9A;&#x4E14;&#x6709;&#x9650;&#x7684;&#x3002;&#x6BD4;&#x5982; MD5 &#x7684;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x56FA;&#x5B9A;&#x7684; 128 &#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x4E32;&#xFF0C;&#x80FD;&#x8868;&#x793A;&#x7684;&#x6570;&#x636E;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x6700;&#x591A;&#x80FD;&#x8868;&#x793A; 2^{128}2128 &#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x8981;&#x54C8;&#x5E0C;&#x7684;&#x6570;&#x636E;&#x662F;&#x65E0;&#x7A77;&#x7684;&#x3002;&#x57FA;&#x4E8E;&#x9E3D;&#x5DE2;&#x539F;&#x7406;&#xFF0C;&#x5982;&#x679C;&#x5BF9; 2^{128}+12128+1 &#x4E2A;&#x6570;&#x636E;&#x6C42;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5C31;&#x5FC5;&#x7136;&#x4F1A;&#x5B58;&#x5728;&#x54C8;&#x5E0C;&#x503C;&#x76F8;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x54C8;&#x5E0C;&#x503C;&#x8D8A;&#x957F;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x6563;&#x5217;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x8D8A;&#x4F4E;&#x3002;</p>
<pre><code>2^128=340282366920938463463374607431768211456Copy to clipboardErrorCopied
</code></pre><p>&#x4F46;MD5&#x6709; 2^{128}2128 &#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x6563;&#x5217;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x5C0F;&#x4E8E; \frac{1}{2^{128}}21281&#xFF0C;&#x51B2;&#x7A81;&#x7684;&#x6982;&#x7387;&#x6781;&#x4F4E;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x6BEB;&#x65E0;&#x89C4;&#x5F8B;&#x7684;&#x7A77;&#x4E3E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x627E;&#x5230;&#x8DDF;&#x4E00;&#x4E2A; MD5 &#x503C;&#x76F8;&#x540C;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x8017;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x4E2A;&#x5929;&#x6587;&#x6570;&#x5B57;&#x3002;&#x6CA1;&#x6709;&#x7EDD;&#x5BF9;&#x5B89;&#x5168;&#x7684;&#x52A0;&#x5BC6;&#x3002;&#x8D8A;&#x590D;&#x6742;&#x3001;&#x8D8A;&#x96BE;&#x7834;&#x89E3;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x4E5F;&#x8D8A;&#x957F;&#x3002;&#x6BD4;&#x5982; SHA-256 &#x6BD4; SHA-1 &#x8981;&#x66F4;&#x590D;&#x6742;&#x3001;&#x66F4;&#x5B89;&#x5168;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x6BD4;&#x8F83;&#x957F;&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x4E8C;-&#x552F;&#x4E00;&#x6807;&#x8BC6;">&#x5E94;&#x7528;&#x4E8C;: &#x552F;&#x4E00;&#x6807;&#x8BC6;</h1>
<p>&#x5982;&#x679C;&#x8981;&#x5728;&#x6D77;&#x91CF;&#x7684;&#x56FE;&#x5E93;&#x4E2D;&#xFF0C;&#x641C;&#x7D22;&#x4E00;&#x5F20;&#x56FE;&#x662F;&#x5426;&#x5B58;&#x5728; &#xFF0C;&#x6BD4;&#x8F83;&#x7B28;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x62FF;&#x8981;&#x67E5;&#x627E;&#x7684;&#x56FE;&#x7247;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x4E32;&#x4E0E;&#x56FE;&#x5E93;&#x4E2D;&#x6240;&#x6709;&#x56FE;&#x7247;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x4E32;&#x4E00;&#x4E00;&#x6BD4;&#x5BF9;&#x3002;&#x5982;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x5219;&#x8BF4;&#x660E;&#x56FE;&#x7247;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x7ED9;&#x6BCF;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x53D6;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x5373;&#x4FE1;&#x606F;&#x6458;&#x8981;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4ECE;&#x56FE;&#x7247;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7801;&#x4E32;&#x5F00;&#x5934;&#x53D6; 100 &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x4ECE;&#x4E2D;&#x95F4;&#x53D6; 100 &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x4ECE;&#x6700;&#x540E;&#x518D;&#x53D6; 100 &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9; 300 &#x4E2A;&#x5B57;&#x8282;&#x653E;&#x5230;&#x4E00;&#x5757;&#xFF0C;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF08;&#x6BD4;&#x5982; MD5&#xFF09;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7528;&#x5B83;&#x4F5C;&#x4E3A;&#x56FE;&#x7247;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x6765;&#x5224;&#x5B9A;&#x56FE;&#x7247;&#x662F;&#x5426;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD8;&#x60F3;&#x7EE7;&#x7EED;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x6BCF;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#x7684;&#x8DEF;&#x5F84;&#x4FE1;&#x606F;&#xFF0C;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x5F53;&#x8981;&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x56FE;&#x7247;&#x662F;&#x4E0D;&#x662F;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x5BF9;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x53D6;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x67E5;&#x627E;&#x662F;&#x5426;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x5C31;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x4E0D;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#xFF1B;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#xFF0C;&#x83B7;&#x53D6;&#x5230;&#x8FD9;&#x4E2A;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8DDF;&#x73B0;&#x5728;&#x8981;&#x63D2;&#x5165;&#x7684;&#x56FE;&#x7247;&#x505A;&#x5168;&#x91CF;&#x7684;&#x6BD4;&#x5BF9;&#xFF0C;&#x770B;&#x662F;&#x5426;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;&#x5982;&#x679C;&#x4E00;&#x6837;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8BF4;&#x660E;&#x4E24;&#x5F20;&#x56FE;&#x7247;&#x5C3D;&#x7BA1;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x662F;&#x76F8;&#x540C;&#x7684;&#x56FE;&#x7247;&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x4E09;&#xFF1A;&#x6570;&#x636E;&#x6821;&#x9A8C;">&#x5E94;&#x7528;&#x4E09;&#xFF1A;&#x6570;&#x636E;&#x6821;&#x9A8C;</h1>
<p>BT &#x4E0B;&#x8F7D;&#x662F;&#x57FA;&#x4E8E; P2P &#x534F;&#x8BAE;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;&#x7535;&#x5F71;&#x6587;&#x4EF6;&#xFF0C;BT &#x4E0B;&#x8F7D;&#x4F1A;&#x4ECE;&#x591A;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x5E76;&#x884C;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A; 2GB &#x7684;&#x7535;&#x5F71;&#xFF0C;&#x8FD9;&#x4E2A;&#x7535;&#x5F71;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5206;&#x5272;&#x6210;&#x5F88;&#x591A;&#x6587;&#x4EF6;&#x5757;&#xFF08;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x5206;&#x6210; 100 &#x5757;&#xFF0C;&#x6BCF;&#x5757;&#x5927;&#x7EA6; 20MB&#xFF09;&#x3002;&#x7B49;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x5757;&#x90FD;&#x4E0B;&#x8F7D;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x7EC4;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7535;&#x5F71;&#x6587;&#x4EF6;&#x5C31;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x4E0B;&#x8F7D;&#x7684;&#x6587;&#x4EF6;&#x5757;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x88AB;&#x5BBF;&#x4E3B;&#x673A;&#x5668;&#x6076;&#x610F;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#xFF0C;&#x53C8;&#x6216;&#x8005;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;&#x4E0B;&#x8F7D;&#x7684;&#x6587;&#x4EF6;&#x5757;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x3002;</p>
<p>&#x79CD;&#x5B50;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x4E86; 100 &#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x5F53;&#x6587;&#x4EF6;&#x5757;&#x4E0B;&#x8F7D;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E0B;&#x8F7D;&#x597D;&#x7684;&#x6587;&#x4EF6;&#x5757;&#x9010;&#x4E00;&#x6C42;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8DDF;&#x79CD;&#x5B50;&#x6587;&#x4EF6;&#x4E2D;&#x4FDD;&#x5B58;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x6BD4;&#x5BF9;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x540C;&#xFF0C;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x4E0D;&#x5B8C;&#x6574;&#x6216;&#x8005;&#x88AB;&#x7BE1;&#x6539;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x518D;&#x91CD;&#x65B0;&#x4ECE;&#x5176;&#x4ED6;&#x5BBF;&#x4E3B;&#x673A;&#x5668;&#x4E0A;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x56DB;&#x6563;&#x5217;&#x51FD;&#x6570;">&#x5E94;&#x7528;&#x56DB;:&#x6563;&#x5217;&#x51FD;&#x6570;</h1>
<p>&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#xFF0C;&#x76F8;&#x5BF9;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#xFF0C;&#x6563;&#x5217;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#x51B2;&#x7A81;&#x7684;&#x8981;&#x6C42;&#x8981;&#x4F4E;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x6563;&#x5217;&#x51FD;&#x6570;&#x5BF9;&#x4E8E;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x503C;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x53CD;&#x5411;&#x89E3;&#x5BC6;&#x4E5F;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x3002;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#xFF0C;&#x66F4;&#x52A0;&#x5173;&#x6CE8;&#x6563;&#x5217;&#x540E;&#x7684;&#x503C;&#x662F;&#x5426;&#x80FD;&#x5E73;&#x5747;&#x5206;&#x5E03;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6563;&#x5217;&#x51FD;&#x6570;&#x7528;&#x7684;&#x6563;&#x5217;&#x7B97;&#x6CD5;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x6BD4;&#x8F83;&#x8FFD;&#x6C42;&#x6548;&#x7387;&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x4E94;&#x8D1F;&#x8F7D;&#x5747;&#x8861;">&#x5E94;&#x7528;&#x4E94;:&#x8D1F;&#x8F7D;&#x5747;&#x8861;</h1>
<p>&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B97;&#x6CD5;&#x6709;&#x8F6E;&#x8BE2;&#x3001;&#x968F;&#x673A;&#x3001;&#x52A0;&#x6743;&#x8F6E;&#x8BE2;&#x7B49;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x7C98;&#x6EDE;&#xFF08;session sticky&#xFF09;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7B97;&#x6CD5;&#x662F;&#x6307;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x4E00;&#x6B21;&#x4F1A;&#x8BDD;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x90FD;&#x8DEF;&#x7531;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p><strong>&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x5BF9;&#x5BA2;&#x6237;&#x7AEF; IP &#x5730;&#x5740;&#x6216;&#x8005;&#x4F1A;&#x8BDD; ID &#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5C06;&#x53D6;&#x5F97;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x5217;&#x8868;&#x7684;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x53D6;&#x6A21;&#x8FD0;&#x7B97;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x503C;&#x5C31;&#x662F;&#x5E94;&#x8BE5;&#x88AB;&#x8DEF;&#x7531;&#x5230;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7F16;&#x53F7;&#x3002;</strong></p>
<h1 id="&#x5E94;&#x7528;&#x516D;&#x6570;&#x636E;&#x5206;&#x7247;">&#x5E94;&#x7528;&#x516D;:&#x6570;&#x636E;&#x5206;&#x7247;</h1>
<p>&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5206;&#x7247;&#xFF1A;</p>
<p><strong>1.&#x5047;&#x5982;1T &#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#xFF0C;&#x91CC;&#x9762;&#x8BB0;&#x5F55;&#x4E86;&#x7528;&#x6237;&#x7684;&#x641C;&#x7D22;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x60F3;&#x8981;&#x5FEB;&#x901F;&#x7EDF;&#x8BA1;&#x51FA;&#x6BCF;&#x4E2A;&#x5173;&#x952E;&#x8BCD;&#x88AB;&#x641C;&#x7D22;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;</strong></p>
<p>&#x95EE;&#x9898;&#xFF1A;&#x641C;&#x7D22;&#x65E5;&#x5FD7;&#x5F88;&#x5927;&#xFF0C;&#x6CA1;&#x529E;&#x6CD5;&#x653E;&#x5230;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#xFF1B;&#x5982;&#x679C;&#x53EA;&#x7528;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E48;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5904;&#x7406;&#x65F6;&#x95F4;&#x4F1A;&#x5F88;&#x957F;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x89E3;&#x51B3;&#x7684;&#x601D;&#x8DEF;&#xFF1A;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x7528; n &#x53F0;&#x673A;&#x5668;&#x5E76;&#x884C;&#x5904;&#x7406;&#x3002;&#x4ECE;&#x641C;&#x7D22;&#x8BB0;&#x5F55;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F9D;&#x6B21;&#x8BFB;&#x51FA;&#x6BCF;&#x4E2A;&#x641C;&#x7D22;&#x5173;&#x952E;&#x8BCD;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8DDF; n &#x53D6;&#x6A21;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x503C;&#x5206;&#x914D;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x3002;</p>
<p>&#x54C8;&#x5E0C;&#x503C;&#x76F8;&#x540C;&#x7684;&#x641C;&#x7D22;&#x5173;&#x952E;&#x8BCD;&#x4F1A;&#x88AB;&#x5206;&#x914D;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x5173;&#x952E;&#x8BCD;&#x4F1A;&#x88AB;&#x5206;&#x914D;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x4F1A;&#x5206;&#x522B;&#x8BA1;&#x7B97;&#x5173;&#x952E;&#x8BCD;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x6700;&#x540E;&#x5408;&#x5E76;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E5F;&#x662F; MapReduce &#x7684;&#x57FA;&#x672C;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x3002;</p>
<p><strong>2. &#x5982;&#x4F55;&#x5FEB;&#x901F;&#x5224;&#x65AD;&#x56FE;&#x7247;&#x662F;&#x5426;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#xFF08;&#x56FE;&#x5E93;&#x4E2D;&#x6709; 1 &#x4EBF;&#x5F20;&#x4EE5;&#x4E0A;&#x7684;&#x6D77;&#x91CF;&#x56FE;&#x7247;&#xFF09;&#xFF1F;</strong></p>
<p>&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x7ED9;&#x6BCF;&#x4E2A;&#x56FE;&#x7247;&#x53D6;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF08;&#x6216;&#x8005;&#x4FE1;&#x606F;&#x6458;&#x8981;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x3002;</p>
<p>&#x95EE;&#x9898;&#xFF1A; 1 &#x4EBF;&#x5F20;&#x56FE;&#x7247;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x4E86;&#x5355;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5185;&#x5B58;&#x4E0A;&#x9650;&#x3002;</p>
<p><strong>&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#xFF1A;</strong></p>
<p>&#x51C6;&#x5907; n &#x53F0;&#x673A;&#x5668;&#xFF0C;&#x8BA9;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x53EA;&#x7EF4;&#x62A4;&#x67D0;&#x4E00;&#x90E8;&#x5206;&#x56FE;&#x7247;&#x5BF9;&#x5E94;&#x7684;&#x6563;&#x5217;&#x8868;&#x3002;&#x6BCF;&#x6B21;&#x4ECE;&#x56FE;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x8BA1;&#x7B97;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E0E;&#x673A;&#x5668;&#x4E2A;&#x6570; n &#x6C42;&#x4F59;&#x53D6;&#x6A21;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x503C;&#x5C31;&#x5BF9;&#x5E94;&#x8981;&#x5206;&#x914D;&#x7684;&#x673A;&#x5668;&#x7F16;&#x53F7;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x548C;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x53D1;&#x5F80;&#x5BF9;&#x5E94;&#x7684;&#x673A;&#x5668;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x3002;</p>
<p>&#x5F53;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x662F;&#x5426;&#x5728;&#x56FE;&#x5E93;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x901A;&#x8FC7;&#x540C;&#x6837;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x7684;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E0E;&#x673A;&#x5668;&#x4E2A;&#x6570; n &#x6C42;&#x4F59;&#x53D6;&#x6A21;&#x3002;&#x5047;&#x8BBE;&#x5F97;&#x5230;&#x7684;&#x503C;&#x662F; k&#xFF0C;&#x90A3;&#x5C31;&#x53BB;&#x7F16;&#x53F7; k &#x7684;&#x673A;&#x5668;&#x6784;&#x5EFA;&#x7684;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x67E5;&#x627E;&#x3002;</p>
<p><strong>&#x7ED9; 1 &#x4EBF;&#x5F20;&#x56FE;&#x7247;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x6240;&#x9700;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4F30;&#x7B97;&#xFF1A;</strong></p>
<p>&#x6563;&#x5217;&#x8868;&#x4E2D;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5355;&#x5143;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x54C8;&#x5E0C;&#x503C;&#x548C;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x5047;&#x8BBE;&#x901A;&#x8FC7; MD5 &#x6765;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x90A3;&#x957F;&#x5EA6;&#x5C31;&#x662F; 128 &#x6BD4;&#x7279;&#xFF0C; 16 &#x5B57;&#x8282;&#x3002;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x7684;&#x4E0A;&#x9650;&#x662F; 256 &#x5B57;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x5E73;&#x5747;&#x957F;&#x5EA6;&#x662F; 128 &#x5B57;&#x8282;&#x3002;&#x5982;&#x679C;&#x7528;&#x94FE;&#x8868;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x90A3;&#x8FD8;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x9488;&#x53EA;&#x5360;&#x7528; 8 &#x5B57;&#x8282;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5355;&#x5143;&#x5C31;&#x5360;&#x7528; 152 &#x5B57;&#x8282;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E3A; 2GB&#xFF0C;&#x6563;&#x5217;&#x8868;&#x7684;&#x88C5;&#x8F7D;&#x56E0;&#x5B50;&#x4E3A; 0.75&#xFF0C;&#x90A3;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x7ED9;&#x5927;&#x7EA6; 1000 &#x4E07;&#xFF08;2GB*0.75/152&#xFF09;&#x5F20;&#x56FE;&#x7247;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x3002;&#x6240;&#x4EE5;&#x5BF9; 1 &#x4EBF;&#x5F20;&#x56FE;&#x7247;&#x6784;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x5927;&#x7EA6;&#x9700;&#x8981;&#x5341;&#x51E0;&#x53F0;&#x673A;&#x5668;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x4F30;&#x7B97;&#x80FD;&#x4E8B;&#x5148;&#x5BF9;&#x9700;&#x8981;&#x6295;&#x5165;&#x7684;&#x8D44;&#x6E90;&#x3001;&#x8D44;&#x91D1;&#x6709;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x8BC4;&#x4F30;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;</p>
<h1 id="&#x5E94;&#x7528;&#x4E03;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;">&#x5E94;&#x7528;&#x4E03;:&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;</h1>
<p>&#x73B0;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x9762;&#x5BF9;&#x7684;&#x90FD;&#x662F;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3001;&#x6D77;&#x91CF;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x3001;&#x5199;&#x5165;&#x80FD;&#x529B;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x91C7;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x3002;&#x6709;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x9700;&#x8981;&#x7F13;&#x5B58;&#xFF0C;&#x4E00;&#x4E2A;&#x7F13;&#x5B58;&#x673A;&#x5668;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;</p>
<p>&#x968F;&#x7740;&#x6570;&#x636E;&#x589E;&#x591A;&#x5C31;&#x9700;&#x8981;&#x589E;&#x52A0;&#x673A;&#x5668;&#x6269;&#x5BB9;&#x4E86;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x6269;&#x5BB9;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x8981;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x7F13;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E00;&#x4E0B;&#x5B50;&#x90FD;&#x5931;&#x6548;&#x4E86;&#x3002;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7og7k7vvj308j06875m.jpg" data-lightbox="e762d843-267a-4f47-b719-19085a54f5ee" data-title="1570443690705" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7og7k7vvj308j06875m.jpg" alt="1570443690705"></a></p>
<p>&#x5F15;&#x5165;<strong>&#x4E00;&#x81F4;&#x6027;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;</strong>&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x5728;&#x65B0;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x642C;&#x79FB;&#x3002;</p>
<h1 id="&#x4E00;&#x81F4;&#x6027;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;">&#x4E00;&#x81F4;&#x6027;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;</h1>
<ol>
<li>&#x9996;&#x5148;&#x7528;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6C42;&#x51FA;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x4E00;&#x822C;&#x7528;ip&#x5730;&#x5740;&#x6216;&#x4E3B;&#x673A;&#x540D;&#xFF09;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E0E;2^{32}232&#x53D6;&#x6A21;&#xFF0C;&#x5C06;&#x5176;&#x6620;&#x5C04;&#x5230;0&#xFF5E;2^{32}0&#xFF5E;232&#x7684;Hash&#x73AF;&#x4E0A;&#x3002;</li>
<li>&#x7136;&#x540E;&#x91C7;&#x7528;&#x540C;&#x6837;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x6C42;&#x51FA;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x952E;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E0E;2^{32}232&#x53D6;&#x6A21;&#xFF0C;&#x6620;&#x5C04;&#x5230;&#x76F8;&#x540C;&#x7684;Hash&#x73AF;&#x4E0A;&#x3002;</li>
<li>&#x7136;&#x540E;&#x4ECE;&#x6570;&#x636E;&#x6620;&#x5C04;&#x5230;&#x7684;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x987A;&#x65F6;&#x9488;&#x67E5;&#x627E;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x627E;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x7531;&#x4E8E;&#x6620;&#x5C04;&#x5728;&#x73AF;&#x4E0A;&#xFF0C;&#x8D85;&#x8FC7;2^{32}232&#x4ECD;&#x7136;&#x627E;&#x4E0D;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x4F1A;&#x6307;&#x5411;&#x7B2C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;</li>
</ol>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ogol43bj30hz0dd76g.jpg" data-lightbox="5f098485-4176-4be6-a6fa-81a9cdd9dc44" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ogol43bj30hz0dd76g.jpg" alt="img"></a></p>
<p>&#x5F53;&#x6DFB;&#x52A0;&#x4E00;&#x53F0;&#x673A;&#x5668;node5&#x65F6;&#xFF0C;&#x5148;&#x8BA1;&#x7B97;hash&#x503C;&#x4E0E;2^{32}232&#x53D6;&#x6A21;&#x5E76;&#x6620;&#x5C04;&#x5230;Hash&#x73AF;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x987A;&#x65F6;&#x9488;&#x6307;&#x5411;node5&#x7684;&#x6570;&#x636E;&#x4ECE;&#x539F;&#x672C;&#x6307;&#x5411;&#x7684;node4&#x8FC1;&#x79FB;&#x5230;node5&#x673A;&#x5668;&#x4E0A;&#xFF1A;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ogxe73kj30jk0djdig.jpg" data-lightbox="6bbb236d-606a-4461-9b1f-d328b1c09091" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ogxe73kj30jk0djdig.jpg" alt="img"></a></p>
<p>&#x5982;&#x679C;node5&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x5B95;&#x673A;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5206;&#x5E03;&#x53C8;&#x4F1A;&#x91CD;&#x65B0;&#x6062;&#x590D;&#x5230;&#x4E0A;&#x56FE;&#x7684;&#x7279;&#x70B9;&#x3002;</p>
<h1 id="hash&#x73AF;&#x7684;&#x504F;&#x659C;">Hash&#x73AF;&#x7684;&#x504F;&#x659C;</h1>
<p>&#x4E0A;&#x9762;&#x63CF;&#x8FF0;&#x4E86;&#x6BD4;&#x8F83;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x6620;&#x5C04;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x6620;&#x5C04;&#x6210;&#x5982;&#x4E0B;&#x6A21;&#x6837;&#xFF1A;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ohf6nljj30bt0bt3z1.jpg" data-lightbox="9212e2ee-d7d2-458d-823c-3abaa6aaa911" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ohf6nljj30bt0bt3z1.jpg" alt="img"></a></p>
<p>&#x8FD9;&#x6837;&#x5927;&#x90E8;&#x5206;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x6620;&#x5C04;&#x5230;&#x4E86;&#x670D;&#x52A1;&#x5668;A&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<h1 id="&#x865A;&#x62DF;&#x8282;&#x70B9;">&#x865A;&#x62DF;&#x8282;&#x70B9;</h1>
<p>&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5747;&#x8861;&#x5730;&#x5C06;&#x7F13;&#x5B58;&#x5206;&#x5E03;&#x5230;&#x4E09;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6700;&#x4F73;&#x529E;&#x6CD5;&#x662F;&#x5C06;&#x73B0;&#x6709;&#x7684;&#x7269;&#x7406;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x865A;&#x62DF;&#x7684;&#x65B9;&#x6CD5;&#x590D;&#x5236;&#x51FA;&#x6765;&#x6620;&#x5C04;&#x5230;Hash&#x73AF;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x7531;&#x5B9E;&#x9645;&#x8282;&#x70B9;&#x865A;&#x62DF;&#x590D;&#x5236;&#x800C;&#x6765;&#x7684;&#x8282;&#x70B9;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x865A;&#x62DF;&#x8282;&#x70B9;&quot;&#x3002;&#x52A0;&#x5165;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x4EE5;&#x540E;&#x7684;hash&#x73AF;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ohw3c1kj30ak0amjrm.jpg" data-lightbox="96ebf56c-c6e3-4de6-828b-9b5c50feb13e" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ohw3c1kj30ak0amjrm.jpg" alt="img"></a></p>
<p>&quot;&#x865A;&#x62DF;&#x8282;&#x70B9;&quot;&#x662F;&quot;&#x5B9E;&#x9645;&#x8282;&#x70B9;&quot;&#xFF08;&#x5B9E;&#x9645;&#x7684;&#x7269;&#x7406;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x5728;hash&#x73AF;&#x4E0A;&#x7684;&#x590D;&#x5236;&#x54C1;&#xFF0C;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5BF9;&#x5E94;&#x591A;&#x4E2A;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x3002;&#x4E0A;&#x56FE;&#x4E2D;A&#x3001;B&#x3001;C&#x4E09;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x5206;&#x522B;&#x865A;&#x62DF;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x3002;&#x5B9E;&#x9645;&#x53EF;&#x4EE5;&#x865A;&#x62DF;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x865A;&#x62DF;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x4FBF;&#x51CF;&#x5C0F;hash&#x73AF;&#x504F;&#x659C;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x8D8A;&#x591A;&#xFF0C;hash&#x73AF;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x7F13;&#x5B58;&#x88AB;&#x5747;&#x5300;&#x5206;&#x5E03;&#x7684;&#x6982;&#x7387;&#x5C31;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6709;4&#x4E2A;&#x7269;&#x7406;&#x8282;&#x70B9;Node&#xFF0C;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x53EF;&#x8BBE;&#x7F6E;&#x4E3A;160&#x4E2A;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x5E26;&#x6765;&#x8F83;&#x597D;&#x7684;&#x5747;&#x5300;&#x5206;&#x5E03;&#xFF1A;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ojlvr6ij30c608rq4l.jpg" data-lightbox="1d40edb2-0dc5-4975-83a6-d48c0ce4f69b" data-title="image-20200124152424750" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ojlvr6ij30c608rq4l.jpg" alt="image-20200124152424750"></a></p>
<p>&#x201C;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x201D;&#x7684;hash&#x8BA1;&#x7B97;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5BF9;&#x5E94;&#x8282;&#x70B9;&#x7684;IP&#x5730;&#x5740;&#x52A0;&#x6570;&#x5B57;&#x540E;&#x7F00;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#x5047;&#x8BBE;NODE1&#x7684;IP&#x5730;&#x5740;&#x4E3A;192.168.1.100&#x3002;&#x5F15;&#x5165;&#x201C;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x201D;&#x524D;&#xFF0C;&#x8BA1;&#x7B97; cache A &#x7684; hash &#x503C;&#xFF1A;</p>
<blockquote>
<p>Hash(&#x201C;192.168.1.100&#x201D;);</p>
</blockquote>
<p>&#x5F15;&#x5165;&#x201C;&#x865A;&#x62DF;&#x8282;&#x70B9;&#x201D;&#x540E;&#xFF0C;&#x8BA1;&#x7B97;&#x201C;&#x865A;&#x62DF;&#x8282;&#x201D;&#x70B9;NODE1-1&#x548C;NODE1-2&#x7684;hash&#x503C;&#xFF1A;</p>
<blockquote>
<p>Hash(&#x201C;192.168.1.100#1&#x201D;); // NODE1-1 Hash(&#x201C;192.168.1.100#2&#x201D;); // NODE1-2</p>
</blockquote>
<h1 id="&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5176;&#x4ED6;&#x5E94;&#x7528;">&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x5176;&#x4ED6;&#x5E94;&#x7528;</h1>
<p>&#x6BD4;&#x5982;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4E2D;&#x7684; CRC &#x6821;&#x9A8C;&#x3001;Git commit id &#x7B49;&#x7B49;&#x3002;</p>
<p>Hash&#x7B97;&#x6CD5;&#x5728;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x5E94;&#x7528;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;&#x4EE5;&#x4E0B;&#x7684;3&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<p>1.&#x6587;&#x4EF6;&#x6821;&#x9A8C;</p>
<p>&#x5E38;&#x89C1;&#x6821;&#x9A8C;&#x7B97;&#x6CD5;&#x6709;&#x5947;&#x5076;&#x6821;&#x9A8C;&#x548C;CRC&#x6821;&#x9A8C;&#xFF0C;&#x8FD9;2&#x79CD;&#x6821;&#x9A8C;&#x5E76;&#x6CA1;&#x6709;&#x6297;&#x6570;&#x636E;&#x7BE1;&#x6539;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5B83;&#x4EEC;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x80FD;&#x68C0;&#x6D4B;&#x5E76;&#x7EA0;&#x6B63;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x4E2D;&#x7684;&#x4FE1;&#x9053;&#x8BEF;&#x7801;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x80FD;&#x9632;&#x6B62;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x6076;&#x610F;&#x7834;&#x574F;&#x3002;</p>
<p>MD5 Hash&#x7B97;&#x6CD5;&#x7684;&#x201C;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x201D;&#x7279;&#x6027;&#xFF0C;&#x4F7F;&#x5B83;&#x6210;&#x4E3A;&#x76EE;&#x524D;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x4E00;&#x79CD;&#x6587;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#x6821;&#x9A8C;&#x548C;&#xFF08;Checksum&#xFF09;&#x7B97;&#x6CD5;&#xFF0C;&#x4E0D;&#x5C11;Unix&#x7CFB;&#x7EDF;&#x6709;&#x63D0;&#x4F9B;&#x8BA1;&#x7B97;md5 checksum&#x7684;&#x547D;&#x4EE4;&#x3002;</p>
<p>2.&#x6570;&#x5B57;&#x7B7E;&#x540D;</p>
<p>Hash &#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x73B0;&#x4EE3;&#x5BC6;&#x7801;&#x4F53;&#x7CFB;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x7531;&#x4E8E;&#x975E;&#x5BF9;&#x79F0;&#x7B97;&#x6CD5;&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x5355;&#x5411;&#x6563;&#x5217;&#x51FD;&#x6570;&#x626E;&#x6F14;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#x3002; &#x5BF9; Hash &#x503C;&#xFF0C;&#x53C8;&#x79F0;&#x201C;&#x6570;&#x5B57;&#x6458;&#x8981;&#x201D;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x5728;&#x7EDF;&#x8BA1;&#x4E0A;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x4E0E;&#x5BF9;&#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x8FDB;&#x884C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x662F;&#x7B49;&#x6548;&#x7684;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x6837;&#x7684;&#x534F;&#x8BAE;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<p>3.&#x9274;&#x6743;&#x534F;&#x8BAE; &#x9274;&#x6743;&#x534F;&#x8BAE;&#x53C8;&#x88AB;&#x79F0;&#x4F5C;&#x6311;&#x6218;--&#x8BA4;&#x8BC1;&#x6A21;&#x5F0F;&#xFF1A;&#x5728;&#x4F20;&#x8F93;&#x4FE1;&#x9053;&#x662F;&#x53EF;&#x88AB;&#x4FA6;&#x542C;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x88AB;&#x7BE1;&#x6539;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x800C;&#x5B89;&#x5168;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h1 id="&#x5982;&#x4F55;&#x9632;&#x6B62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x88AB;&#x8131;&#x5E93;">&#x5982;&#x4F55;&#x9632;&#x6B62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;&#x88AB;&#x8131;&#x5E93;?</h1>
<p>&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x76D0;&#xFF08;salt&#xFF09;&#xFF0C;&#x8DDF;&#x7528;&#x6237;&#x7684;&#x5BC6;&#x7801;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x62FF;&#x7EC4;&#x5408;&#x4E4B;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x505A;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x52A0;&#x5BC6;&#xFF0C;&#x5C06;&#x5B83;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5B89;&#x5168;&#x548C;&#x653B;&#x51FB;&#x662F;&#x4E00;&#x79CD;&#x535A;&#x5F08;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x7EDD;&#x5BF9;&#x7684;&#x5B89;&#x5168;&#x3002;&#x6240;&#x6709;&#x7684;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#xFF0C;&#x53EA;&#x662F;&#x589E;&#x52A0;&#x653B;&#x51FB;&#x7684;&#x6210;&#x672C;&#x800C;&#x5DF2;&#x3002;</p>
<h1 id="&#x533A;&#x5757;&#x94FE;&#x6BD4;&#x7279;&#x5E01;">&#x533A;&#x5757;&#x94FE;&amp;&#x6BD4;&#x7279;&#x5E01;</h1>
<p>&#x533A;&#x5757;&#x94FE;&#x662F;&#x7531;&#x5305;&#x542B;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x533A;&#x5757;&#x4ECE;&#x540E;&#x5411;&#x524D;&#x6709;&#x5E8F;&#x94FE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;. &#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x5B58;&#x50A8;&#x4E3A;flat file (&#x4E00;&#x79CD;&#x5305;&#x542B;&#x975E;&#x76F8;&#x5BF9;&#x5173;&#x7CFB;&#x8BB0;&#x5F55;&#x7684;&#x6587;&#x4EF6;),&#x6216;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x6570;&#x636E;&#x5E93;&#x4E2D;.&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;(Bitcoin Core)&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;Google&#x7684;LeveLDB&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x533A;&#x5757;&#x94FE;&#x5143;&#x6570;&#x636E;.&#x533A;&#x5757;&#x88AB;&#x4ECE;&#x540E;&#x5411;&#x524D;&#x6709;&#x5E8F;&#x5730;&#x94FE;&#x63A5;&#x5728;&#x8FD9;&#x4E2A;&#x94FE;&#x6761;&#x91CC;,&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x6307;&#x5411;&#x524D;&#x4E00;&#x4E2A;&#x533A;&#x5757;.</p>
<p>&#x533A;&#x5757;&#x94FE;&#x7ECF;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x7684;&#x6808;,&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x6808;&#x5E95;&#x7684;&#x9996;&#x533A;&#x5757;,&#x968F;&#x540E;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x5176;&#x4ED6;&#x533A;&#x5757;&#x4E4B;&#x4E0A;.&#x7528;&#x6808;&#x6765;&#x5F62;&#x8C61;&#x5316;&#x8868;&#x793A;&#x533A;&#x5757;&#x4F9D;&#x6B21;&#x5806;&#x53E0;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x540E;, &#x6211;&#x4EEC;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x672F;&#x8BED;,&#x4F8B;&#x5982;,&quot;&#x9AD8;&#x5EA6;&quot;&#x6765;&#x8868;&#x793A;&#x533A;&#x5757;&#x4E0E;&#x9996;&#x533A;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;;&#x4EE5;&#x53CA;&#x7528;&quot;&#x9876;&#x90E8;&quot;&#x6216;&quot;&#x9876;&#x7AEF;&quot;&#x6765;&#x8868;&#x793A;&#x6700;&#x65B0;&#x6DFB;&#x52A0;&#x7684;&#x533A;&#x5757;.</p>
<p>&#x5BF9;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5934;&#x8FDB;&#x884C;SHA256&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;,&#x53EF;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;.&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;, &#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x533A;&#x5757;.&#x540C;&#x65F6;,&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x533A;&#x5757;&#x5934;&#x7684;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&quot;&#x5B57;&#x6BB5;&#x5F15;&#x7528;&#x524D;&#x4E00;&#x533A;&#x5757;(&#x7236;&#x533A;&#x5757;).&#x4E5F;&#x5C31;&#x662F;&#x8BF4;,&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5934;&#x90FD;&#x5305;&#x542B;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;.&#x8FD9;&#x6837;&#x628A;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x63A5;&#x5230;&#x5404;&#x81EA;&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x5E8F;&#x5217;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x6761;&#x4E00;&#x76F4;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;&#x7B2C;&#x4E00;&#x533A;&#x5757;(&#x521B;&#x4E16;&#x533A;&#x5757;&#xFF09;&#x7684;&#x94FE;&#x6761;.</p>
<p>&#x867D;&#x7136;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x533A;&#x5757;,&#x4F46;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x5B50;&#x533A;&#x5757;.&#x6BCF;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x90FD;&#x5C06;&#x540C;&#x4E00;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x5176;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&quot;&#x5B57;&#x6BB5;&#x4E2D;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;(&#x7236;&#x533A;&#x5757;)&#x54C8;&#x5E0C;&#x503C;.&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x7684;&#x60C5;&#x51B5;&#x88AB;&#x79F0;&#x4E3A;&quot;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&quot;.&#x533A;&#x5757;&#x94FE;&#x5206;&#x4E49;&#x53EA;&#x662F;&#x6682;&#x65F6;&#x72B6;&#x6001;,&#x53EA;&#x6709;&#x5F53;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x533A;&#x5757;&#x51E0;&#x4E4E;&#x540C;&#x65F6;&#x88AB;&#x4E0D;&#x540C;&#x7684;&#x77FF;&#x5DE5;&#x53D1;&#x73B0;&#x65F6;&#x624D;&#x4F1A;&#x53D1;&#x751F;. &#x6700;&#x7EC8;,&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x4F1A;&#x6210;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x90E8;&#x5206;,&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&quot;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&quot;&#x7684;&#x95EE;&#x9898;.&#x5C3D;&#x7BA1;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x5B50;&#x533A;&#x5757;,&#x4F46;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x533A;&#x5757;,&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&quot;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x7236;&#x533A;&#x5757;.</p>
<p>&#x7531;&#x4E8E;&#x533A;&#x5757;&#x5934;&#x91CC;&#x9762;&#x5305;&#x542B;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&quot;&#x5B57;&#x6BB5;,&#x6240;&#x4EE5;&#x5F53;&#x524D;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x56E0;&#x6B64;&#x4E5F;&#x53D7;&#x5230;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x5F71;&#x54CD;.&#x5982;&#x679C;&#x7236;&#x533A;&#x5757;&#x7684;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x53D1;&#x751F;&#x53D8;&#x5316;,&#x5B50;&#x533A;&#x5757;&#x7684;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x4E5F;&#x4F1A;&#x8DDF;&#x770B;&#x53D8;&#x5316;.&#x5F53;&#x7236;&#x533A;&#x5757;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x65F6;,&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E5F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x5C06;&#x8FEB;&#x4F7F;&#x5B50;&#x533A;&#x5757;&#x7684;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&quot;&#x5B57;&#x6BB5;&#x53D1;&#x751F;&#x6539;&#x53D8;,&#x4ECE;&#x800C;&#x53C8;&#x5C06;&#x5BFC;&#x81F4;&#x5B50;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;.&#x800C;&#x5B50;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x53C8;&#x5C06;&#x8FEB;&#x4F7F;&#x5B59;&#x533A;&#x5757;&#x7684;&quot;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x53D1;&#x751F;&#x6539;&#x53D8;,&#x53C8;&#x56E0;&#x6B64;&#x6539;&#x53D8;&#x4E86;&#x5B59;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;,&#x7B49;&#x7B49;,&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;.&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x81EA;&#x5F88;&#x591A;&#x4EE3;&#x4EE5;&#x540E;,&#x8FD9;&#x79CD;<strong>&#x7011;&#x5E03;&#x6548;&#x5E94;</strong>&#x5C06;&#x4FDD;&#x8BC1;&#x8BE5;&#x533A;&#x5757;&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x53D8;,&#x9664;&#x975E;&#x5F3A;&#x5236;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x8BE5;&#x533A;&#x5757;&#x6240;&#x6709;&#x540E;&#x7EED;&#x7684;&#x533A;&#x5757;.&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5DE8;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x91CF;,&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x957F;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5B58;&#x5728;&#x53EF;&#x4EE5;&#x8BA9;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5386;&#x53F2;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6BD4;&#x7279;&#x5DFE;&#x5B89;&#x5168;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x5F81;.</p>
<h1 id="&#x533A;&#x5757;&#x7ED3;&#x6784;">&#x533A;&#x5757;&#x7ED3;&#x6784;</h1>
<p>&#x533A;&#x5757;&#x662F;&#x4E00;&#x79CD;&#x88AB;&#x5305;&#x542B;&#x5728;&#x516C;&#x5F00;&#x8D26;&#x7C3F;(&#x533A;&#x5757;&#x94FE;)&#x91CC;&#x7684;&#x805A;&#x5408;&#x4E86;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x5BB9;&#x5668;&#x6570;&#x636E;&#x7ED3;&#x6784;.&#x5B83;&#x7531;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x5143;&#x6570;&#x636E;&#x7684;&#x533A;&#x5757;&#x5934;&#x548C;&#x7D27;&#x8DDF;&#x5176;&#x540E;&#x7684;&#x6784;&#x6210;&#x533A;&#x5757;&#x4E3B;&#x4F53;&#x7684;&#x4E00;&#x957F;&#x4E32;&#x4EA4;&#x6613;&#x7EC4;&#x6210;.&#x533A;&#x5757;&#x5934;&#x662F;80&#x5B57;&#x8282;,&#x800C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x81F3;&#x5C11;&#x662F;250&#x5B57;&#x8282;,&#x800C;&#x4E14;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x8D85;&#x8FC7;500&#x4E2A;&#x4EA4;&#x6613;.&#x56E0;&#x6B64;, &#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x5143;&#x6574;&#x533A;&#x5757;&#x6BD4;&#x533A;&#x5757;&#x5934;&#x7684;1000&#x500D;&#x8FD8;&#x8981;&#x5927;.&#x4E0B;&#x8868;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7ED3;&#x6784;.</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7olgw49zj30k005waal.jpg" data-lightbox="aab44409-96ea-4a6a-9baf-088f6d9ec4dc" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7olgw49zj30k005waal.jpg" alt="img"></a></p>
<h1 id="&#x533A;&#x5757;&#x5934;&#x533A;&#x5757;&#x4E2D;&#x7684;b&#x6BB5;">&#x533A;&#x5757;&#x5934;(&#x533A;&#x5757;&#x4E2D;&#x7684;B&#x6BB5;)</h1>
<p>&#x533A;&#x5757;&#x5934;&#x7531;&#x4E09;&#x7EC4;&#x533A;&#x5757;&#x5143;&#x6570;&#x636E;&#x7EC4;&#x6210;.&#x9996;&#x5148;&#x662F;&#x4E00;&#x7EC4;&#x5F15;&#x7528;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x6570;&#x636E;,&#x8FD9;&#x7EC4;&#x5143;&#x6570;&#x636E;&#x7528;&#x4E8E;&#x5C06;&#x8BE5;&#x533A;&#x5757;&#x4E0E;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x524D;&#x4E00;&#x533A;&#x5757;&#x76F8;&#x8FDE;&#x63A5;&#x3002;&#x7B2C;&#x4E8C;&#x7EC4;&#x5143;&#x6570;&#x636E; &#x5373;&#x96BE;&#x5EA6;&#x3001;&#x65F6;&#x95F4;&#x6233;&#x548C;Nonce,&#x4E0E;&#x6316;&#x77FF;&#x7ADE;&#x4E89;&#x76F8;&#x5173;.&#x7B2C;&#x4E09;&#x7EC4;&#x5143;&#x6570;&#x636E;&#x662F;Merkle&#x6811;&#x6839;(&#x4E00;&#x79CD;&#x7528;&#x6765;&#x6709;&#x6548;&#x5730;&#x603B;&#x7ED3;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7olxzehsj30k008qwfc.jpg" data-lightbox="3e366f1d-460a-46f7-9a3b-b5cb3e6a45ca" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7olxzehsj30k008qwfc.jpg" alt="img"></a></p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7om629h8j30hs0a0gnc.jpg" data-lightbox="29476f8b-cef1-4850-8c4a-512527a0976c" data-title="img" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7om629h8j30hs0a0gnc.jpg" alt="img"></a></p>
<h1 id="&#x6316;&#x77FF;&#x7B97;&#x6CD5;">&#x6316;&#x77FF;&#x7B97;&#x6CD5;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x603B;&#x7ED3;&#x4E3A;<strong>&#x5BF9;&#x533A;&#x5757;&#x5934;&#x505A;&#x4E24;&#x6B21;sha256&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5982;&#x679C;&#x5C0F;&#x4E8E;&#x533A;&#x5757;&#x5934;&#x4E2D;&#x89C4;&#x5B9A;&#x7684;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#xFF0C;&#x5373;&#x6316;&#x77FF;&#x6210;&#x529F;</strong>&#x3002;</p>
<p><a href="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ommypd2j309s0b0jtk.jpg" data-lightbox="b1bd97ea-e1f4-4d7e-9f24-d53417e2a8be" data-title="1571762267701" target="_blank"><img src="https://tva1.sinaimg.cn/large/006tNbRwly1gb7ommypd2j309s0b0jtk.jpg" alt="1571762267701"></a></p>
<p>&#x6316;&#x77FF;&#x7684;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E3A;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;</p>
<ol>
<li>&#x9A8C;&#x8BC1;&#x548C;&#x7B5B;&#x9009;&#x4EA4;&#x6613;</li>
<li>&#x8BA1;&#x7B97;Merkle root</li>
<li>&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x5934;</li>
<li>&#x7A77;&#x4E3E;nonce&#x8BA1;&#x7B97;hash</li>
</ol>
<h1 id="&#x9A8C;&#x8BC1;&#x548C;&#x7B5B;&#x9009;&#x4EA4;&#x6613;">&#x9A8C;&#x8BC1;&#x548C;&#x7B5B;&#x9009;&#x4EA4;&#x6613;</h1>
<p>&#x6316;&#x77FF;&#x8282;&#x70B9;&#x9996;&#x5148;&#x5BF9;&#x4EA4;&#x6613;&#x505A;&#x9A8C;&#x8BC1;&#xFF0C;&#x5254;&#x9664;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x5957;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x51C6;&#x6765;&#x9009;&#x62E9;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x5E0C;&#x671B;&#x6253;&#x5305;&#x8FDB;&#x533A;&#x5757;&#xFF0C;&#x6BD4;&#x5982;&#x901A;&#x8FC7;&#x4EA4;&#x6613;&#x8D39;&#x4E0E;&#x4EA4;&#x6613;&#x5360;&#x7528;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x6BD4;&#x503C;&#x8D85;&#x8FC7;&#x67D0;&#x4E2A;&#x95E8;&#x69DB;&#x6765;&#x5224;&#x65AD;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x4EA4;&#x6613;&#x624D;&#x88AB;&#x8BA4;&#x4E3A;&#x6709;&#x5229;&#x53EF;&#x56FE;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8282;&#x70B9;&#x4E5F;&#x53EF;&#x4EE5;&#x7279;&#x610F;&#x9009;&#x62E9;&#x8981;&#x52A0;&#x5165;&#x67D0;&#x6761;&#x4EA4;&#x6613;&#xFF0C;&#x6216;&#x8005;&#x6545;&#x610F;&#x5FFD;&#x7565;&#x67D0;&#x4E9B;&#x4EA4;&#x6613;&#xFF0C;&#x6BCF;&#x4E2A;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x6709;&#x5F88;&#x5927;&#x7684;&#x81EA;&#x7531;&#x88C1;&#x5EA6;&#x6743;&#x529B;&#x3002;&#x5982;&#x679C;&#x662F;&#x901A;&#x8FC7;&#x77FF;&#x6C60;&#x6316;&#x77FF;&#x7684;&#x8BDD;&#xFF0C;&#x77FF;&#x6C60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x53BB;&#x7B5B;&#x9009;&#x4EA4;&#x6613;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x914D;&#x7ED9;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x7684;&#x77FF;&#x673A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x96BE;&#x5EA6;&#x5C0F;&#x4E8E;&#x603B;&#x7684;&#x6316;&#x77FF;&#x96BE;&#x5EA6;&#xFF0C;&#x901A;&#x8FC7;&#x5B8C;&#x6210;&#x8F83;&#x5C0F;&#x96BE;&#x5EA6;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x6765;&#x786E;&#x8BA4;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x7684;&#x4EFD;&#x989D;&#x3002;&#x6BCF;&#x53F0;&#x4E0D;&#x540C;&#x7684;&#x77FF;&#x673A;&#x8BA1;&#x7B97;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x4F1A;&#x91CD;&#x590D;&#xFF0C;&#x5F53;&#x5176;&#x4E2D;&#x4E00;&#x53F0;&#x77FF;&#x673A;&#x6210;&#x529F;&#x6316;&#x77FF;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x77FF;&#x673A;&#x4F9D;&#x636E;&#x786E;&#x8BA4;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6765;&#x5206;&#x914D;&#x6536;&#x76CA;&#x3002;</p>
<h1 id="&#x8BA1;&#x7B97;merkle-root">&#x8BA1;&#x7B97;Merkle root</h1>
<p>&#x4E00;&#x65E6;&#x7B5B;&#x9009;&#x597D;&#x4EA4;&#x6613;&#x6570;&#x636E;&#xFF0C;&#x6309;&#x7167;&#x65F6;&#x95F4;&#x6392;&#x5E8F;&#xFF0C;&#x4E24;&#x4E24;&#x54C8;&#x5E0C;&#xFF0C;&#x5C42;&#x5C42;&#x7EA6;&#x51CF;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x5C31;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x68F5;Merkle&#x6811;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6458;&#x8981;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;Merkl&#x6811;&#x7684;&#x6839;&#x3002;Merkle&#x6811;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;merkle root&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x662F;&#x5426;&#x88AB;&#x6539;&#x52A8;&#x8FC7;&#x3002;</p>
<pre><code class="lang-python">ABCDEEEE .......Merkle root
      /        \
   ABCD        EEEE
  /    \      /
 AB    CD    EE .......E&#x4E0E;&#x81EA;&#x5DF1;&#x914D;&#x5BF9;,&#x5947;&#x6570;&#x6811;&#x53F6;&#x65F6;
/  \  /  \  /
A  B  C  D  E .........&#x4EA4;&#x6613;
</code></pre>
<h1 id="&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x5934;">&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x5934;</h1>
<p>&#x4F9D;&#x6B21;&#x83B7;&#x53D6;&#x6316;&#x77FF;&#x9700;&#x8981;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x533A;&#x5757;&#x5934;&#x4FE1;&#x606F;&#x3002; &#x533A;&#x5757;&#x5934;&#x53EA;&#x6709;80&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x6316;&#x77FF;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x533A;&#x5757;&#x5934;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x5373;&#x53EF;&#x3002;&#x533A;&#x5757;&#x5934;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5728;&#x6316;&#x77FF;&#x524D;&#x5927;&#x90E8;&#x5206;&#x5DF2;&#x7ECF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5BB9;&#x6613;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x867D;&#x7136;&#x5F88;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;Merkle&#x6811;&#x56FA;&#x5B9A;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x5305;&#x542B;&#x8FDB;&#x6765;&#x3002;</p>
<p>&#x9010;&#x9879;&#x51C6;&#x5907;&#x9700;&#x8981;&#x7684;&#x6570;&#x5B57;&#xFF1A;</p>
<p><strong>&#x7248;&#x672C;&#x53F7;</strong></p>
<p>&#x8DDF;&#x968F;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x800C;&#x5B9A;&#xFF0C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x3002;&#x5373;&#x4F7F;&#x8981;&#x6539;&#x53D8;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x534F;&#x8C03;&#x5347;&#x7EA7;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x5E38;&#x6570;&#x3002;</p>
<p><strong>&#x524D;&#x4E00;&#x533A;&#x5757;&#x6458;&#x8981;</strong></p>
<p>&#x4E00;&#x6B21;&#x54C8;&#x5E0C;&#x5373;&#x53EF;&#x3002;&#x524D;&#x4E00;&#x533A;&#x5757;&#x5DF2;&#x7ECF;&#x662F;&#x6253;&#x5305;&#x597D;&#x7684;&#x3002;</p>
<p><strong>&#x9ED8;&#x514B;&#x5C14;&#x6839;</strong></p>
<p>&#x521A;&#x624D;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x7ED3;&#x679C;&#xFF0C;&#x6839;&#x636E;&#x672C;&#x6B21;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x7684;&#x4EA4;&#x6613;&#x5217;&#x8868;&#x5F97;&#x5230;&#x3002;</p>
<p><strong>&#x65F6;&#x95F4;</strong></p>
<p>&#x53D6;&#x6253;&#x5305;&#x65F6;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x7CBE;&#x786E;&#xFF0C;&#x524D;&#x540E;&#x51E0;&#x79D2;&#xFF0C;&#x51E0;&#x5341;&#x79D2;&#x4E5F;&#x90FD;&#x53EF;&#x4EE5;&#x3002;</p>
<p><strong>&#x96BE;&#x5EA6;&#x76EE;&#x6807;</strong></p>
<p>&#x53C2;&#x8003;&#x4E0A;&#x4E24;&#x5468;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x7684;&#x5E73;&#x5747;&#x751F;&#x6210;&#x65F6;&#x95F4;&#x800C;&#x5B9A;&#x3002;&#x4E24;&#x5468;&#x5185;&#x5982;&#x679C;&#x5E73;&#x5747;10&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x8BDD;&#xFF0C;&#x4E24;&#x5468;&#x4F1A;&#x4EA7;&#x751F;2016&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x8F6F;&#x4EF6;&#x4F1A;&#x8BA1;&#x7B97;&#x6700;&#x65B0;&#x7684;2016&#x4E2A;&#x533A;&#x5757;&#x751F;&#x6210;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x5BF9;&#x6BD4;&#xFF0C;&#x968F;&#x4E4B;&#x8C03;&#x6574;&#x96BE;&#x5EA6;&#xFF0C;&#x4F7F;&#x5F97;&#x63A5;&#x4E0B;&#x6765;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x7684;&#x9884;&#x671F;&#x65F6;&#x95F4;&#x4FDD;&#x6301;&#x5728;10&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x3002;&#x56E0;&#x4E3A;&#x6700;&#x8FD1;&#x7684;2016&#x4E2A;&#x533A;&#x5757;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x4E5F;&#x662F;&#x786E;&#x5B9A;&#x7684;&#x3002;</p>
<p><strong>&#x968F;&#x673A;&#x6570;nonce</strong></p>
<p>&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x6316;&#x77FF;&#x7684;&#x76EE;&#x6807;&#x4E86;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;32&#x4F4D;&#x7684;&#x6570;&#x5B57;&#x3002;</p>
<h3 id="&#x7A77;&#x4E3E;nonce&#x8BA1;&#x7B97;hash">&#x7A77;&#x4E3E;nonce&#x8BA1;&#x7B97;hash</h3>
<p>&#x968F;&#x673A;&#x6570;&#x53EF;&#x4EE5;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x4ECE;0&#x8BD5;&#x5230;&#x6700;&#x5927;&#x503C;2^32&#x3002;&#x76F4;&#x5230;&#x6700;&#x540E;&#x51FA;&#x73B0;&#x7684;hash&#x7ED3;&#x679C;&#xFF0C;&#x5176;&#x6570;&#x5B57;&#x4F4E;&#x4E8E;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x503C;&#x3002;&#x4E0D;&#x8FC7;&#x4EE5;&#x73B0;&#x5728;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7B97;&#x529B;&#xFF0C;&#x4E00;&#x53F0;&#x77FF;&#x673A;&#x7528;&#x4E0D;&#x4E86;&#x4E00;&#x79D2;&#x5C31;&#x628A;&#x5168;&#x90E8;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x80FD;&#x8BA1;&#x7B97;&#x5B8C;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x9700;&#x8981;&#x6539;&#x53D8;&#x533A;&#x5757;&#x5185;&#x90E8;&#x7684;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x9644;&#x5E26;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x8BA9;merkle root&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x66F4;&#x591A;&#x7684;&#x53EF;&#x80FD;&#x53BB;&#x627E;&#x5230;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;nonce&#x3002;</p>
<p>&#x6316;&#x77FF;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x65B0;&#x53D1;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x63A5;&#x6536;&#x65B9;&#x5C31;&#x662F;&#x77FF;&#x5DE5;&#x6307;&#x5B9A;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x662F;&#x6316;&#x77FF;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x5956;&#x52B1;&#xFF1B;&#x53E6;&#x5916;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x6765;&#x81EA;&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#x3002;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#x65B9;&#xFF0C;&#x79F0;&#x4E3A;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; yxm666.github.io/mybook 2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2020-01-24 15:32:34
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style> <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="散列表.html" class="navigation navigation-prev " aria-label="Previous page: 10.散列表">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="二叉树.html" class="navigation navigation-next " aria-label="Next page: 12.二叉树">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"11.哈希算法","level":"3.10","depth":1,"next":{"title":"12.二叉树","level":"3.11","depth":1,"path":"二叉树.md","ref":"二叉树.md","articles":[]},"previous":{"title":"10.散列表","level":"3.9","depth":1,"path":"散列表.md","ref":"散列表.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["flexible-alerts","-search","search-pro","pageview-count","simple-page-toc","tbfed-pagefooter","popup","sharing-plus","klipse","flexible-alerts","pageview-count","auto-scroll-table","lightbox","advanced-emoji","katex","disqus","back-to-top-button","chapter-fold","-lunr","splitter","github","github-buttons","code"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy yxm666.github.io/mybook 2019","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"disqus":{"useIdentifier":false,"shortName":"gitbookuse"},"github":{"url":"https://github.com/yxm666"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"auto-scroll-table":{},"popup":{},"code":{"copyButtons":true},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"lightbox":{"jquery":true,"sameUuid":false},"back-to-top-button":{},"pageview-count":{},"github-buttons":{"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"callout","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"}},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"instapaper":false,"twitter":true,"vk":false,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"哈希算法.md","mtime":"2020-01-24T07:32:34.106Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-31T09:32:44.183Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-auto-scroll-table/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

