
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>入门篇 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-auto-scroll-table/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Array.html" />
    
    
    <link rel="prev" href="./" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    书籍介绍
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">入门篇</li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    入门篇
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="Array.html">
            
                <a href="Array.html">
            
                    
                    02. 数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="LinkList.html">
            
                <a href="LinkList.html">
            
                    
                    03. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="递归.html">
            
                <a href="递归.html">
            
                    
                    04. 递归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="Stack.html">
            
                <a href="Stack.html">
            
                    
                    05. 栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="queue.html">
            
                <a href="queue.html">
            
                    
                    06. 队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="sort.html">
            
                <a href="sort.html">
            
                    
                    07. 排序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="二分查找.html">
            
                <a href="二分查找.html">
            
                    
                    08. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.8" data-path="跳表.html">
            
                <a href="跳表.html">
            
                    
                    09.跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.9" data-path="散列表.html">
            
                <a href="散列表.html">
            
                    
                    10.散列表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.10" data-path="哈希算法.html">
            
                <a href="哈希算法.html">
            
                    
                    11.哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.11" data-path="二叉树.html">
            
                <a href="二叉树.html">
            
                    
                    12.二叉树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.12" data-path="红黑树.md">
            
                <span>
            
                    
                    13.红黑树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.13" data-path="二叉堆.html">
            
                <a href="二叉堆.html">
            
                    
                    14.二叉堆与优先队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.14" data-path="图.html">
            
                <a href="图.html">
            
                    
                    15.图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.15" data-path="DFS and BFS.html">
            
                <a href="DFS and BFS.html">
            
                    
                    16.深度优先遍历 和 广度优先遍历
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >入门篇</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="01-&#x5165;&#x95E8;&#x7BC7;"><strong>01. &#x5165;&#x95E8;&#x7BC7;</strong></h1>
<hr>
<h2 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;"><strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;</strong></h2>
<hr>
<h3 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x5B9A;&#x4E49;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x5B9A;&#x4E49;</h3>
<p>&#x200B;    &#x4ECE;&#x5E7F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x3002;&#x7B97;&#x6CD5;&#x5C31;&#x662F;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x7684;&#x4E00;&#x7EC4;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x56FE;&#x4E66;&#x7BA1;&#x7406;&#x5458;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x67E5;&#x627E;&#xFF0C;&#x4E00;&#x822C;&#x4F1A;&#x5C06;&#x4E66;&#x7C4D;&#x5206;&#x95E8;&#x522B;&#x7C7B;&#x8FDB;&#x884C;&#x201C;<strong>&#x5B58;&#x50A8;</strong>&#x201D;&#x3002;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x89C4;&#x5F8B;&#x7F16;&#x53F7;&#xFF0C;&#x5C31;&#x662F;&#x4E66;&#x7C4D;&#x8FD9;&#x79CD;&#x201C;&#x6570;&#x636E;&#x201D;&#x7684;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#x3002;</p>
<p><strong>&#x67E5;&#x627E;&#x4E00;&#x672C;&#x4E66;</strong>&#x6709;&#x5F88;&#x591A;&#x79CD;&#x529E;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E00;&#x672C;&#x4E00;&#x672C;&#x5730;&#x627E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5148;&#x6839;&#x636E;&#x4E66;&#x7C4D;&#x7C7B;&#x522B;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x662F;&#x4EBA;&#x6587;&#xFF0C;&#x8FD8;&#x662F;&#x79D1;&#x5B66;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x6765;&#x5B9A;&#x4F4D;&#x4E66;&#x67B6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4F9D;&#x6B21;&#x67E5;&#x627E;&#x3002;&#x7B3C;&#x7EDF;&#x5730;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x67E5;&#x627E;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x4ECE;&#x72ED;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x662F;&#x6307;&#x67D0;&#x4E9B;&#x8457;&#x540D;&#x7684;<strong>&#x961F;&#x5217;&#x3001;&#x6808;&#x3001;&#x5806;&#x3001;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x3001;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7B49;</strong>&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x524D;&#x4EBA;&#x4ECE;&#x5F88;&#x591A;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x573A;&#x666F;&#x4E2D;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x7ECF;&#x8FC7;&#x975E;&#x5E38;&#x591A;&#x7684;&#x6C42;&#x8BC1;&#x548C;&#x68C0;&#x9A8C;&#xFF0C;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x5F88;&#x591A;&#x5B9E;&#x9645;&#x7684;&#x5F00;&#x53D1;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x7CFB;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x7CFB;</h3>
<hr>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E3A;&#x7B97;&#x6CD5;&#x670D;&#x52A1;&#x7684;&#xFF0C;&#x7B97;&#x6CD5;&#x8981;&#x4F5C;&#x7528;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E4B;&#x4E0A;&#x3002;</strong></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5B64;&#x7ACB;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BB2;&#x7B97;&#x6CD5;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x5B64;&#x7ACB;&#x7B97;&#x6CD5;&#x6765;&#x8BB2;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x5177;&#x6709;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x7528;&#x6570;&#x7EC4;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x94FE;&#x8868;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x7B97;&#x6CD5;&#x5C31;&#x65E0;&#x6CD5;&#x5DE5;&#x4F5C;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x94FE;&#x8868;&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x5B83;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x64CD;&#x4F5C;&#x3001;&#x6784;&#x5EFA;&#x7B97;&#x6CD5;&#xFF0C;&#x5B64;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x6CA1;&#x7528;&#x7684;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x5206;&#x6574;&#x4F53;&#x6846;&#x67B6;">&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x5206;&#x6574;&#x4F53;&#x6846;&#x67B6;</h3>
<hr>
<p><a href="https://datastructure.xiaoxiaoming.xyz/imgs/1.jpg" data-lightbox="db432c65-55ad-499f-b445-60a333165a3d" data-title="img" target="_blank"><img src="https://datastructure.xiaoxiaoming.xyz/imgs/1.jpg" alt="img"></a></p>
<p><strong>20 &#x4E2A;&#x6700;&#x5E38;&#x7528;&#x7684;&#x3001;&#x6700;&#x57FA;&#x7840;</strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0E;&#x7B97;&#x6CD5;&#xFF1A;</p>
<p>10 &#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;<strong>&#x6570;&#x7EC4;&#x3001;&#x94FE;&#x8868;&#x3001;&#x6808;&#x3001;&#x961F;&#x5217;&#x3001;&#x6563;&#x5217;&#x8868;&#x3001;&#x4E8C;&#x53C9;&#x6811;&#x3001;&#x5806;&#x3001;&#x8DF3;&#x8868;&#x3001;&#x56FE;&#x3001;Trie &#x6811;</strong>&#xFF1B;</p>
<p>10 &#x4E2A;&#x7B97;&#x6CD5;&#xFF1A;<strong>&#x9012;&#x5F52;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x4E8C;&#x5206;&#x67E5;&#x627E;&#x3001;&#x641C;&#x7D22;&#x3001;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x3001;&#x8D2A;&#x5FC3;&#x7B97;&#x6CD5;&#x3001;&#x5206;&#x6CBB;&#x7B97;&#x6CD5;&#x3001;&#x56DE;&#x6EAF;&#x7B97;&#x6CD5;&#x3001;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x5339;&#x914D;&#x7B97;&#x6CD5;</strong>&#x3002;</p>
<p>&#x638C;&#x63E1;&#x4E86;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x518D;&#x5B66;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#xFF0C;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3001;&#x975E;&#x5E38;&#x5FEB;&#x3002;</p>
<p>&#x5728;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5E94;&#x5F53;&#x5B66;&#x4E60;&#x5B83;&#x7684;&#xFF1A;</p>
<p><strong>&#x201C;&#x6765;&#x5386;&#x201D;</strong></p>
<p><strong>&#x201C;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x201D;</strong></p>
<p><strong>&#x201C;&#x9002;&#x5408;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x201D;</strong></p>
<p><strong>&#x4EE5;&#x53CA;&#x201C;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x201D;</strong>&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;">&#x65F6;&#x95F4;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;</h2>
<hr>
<p>&#x200B;    <strong>&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x662F;&#x6574;&#x4E2A;&#x7B97;&#x6CD5;&#x5B66;&#x4E60;&#x7684;&#x7CBE;&#x9AD3;&#xFF0C;&#x53EA;&#x8981;&#x638C;&#x63E1;&#x4E86;&#x5B83;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x7684;&#x5185;&#x5BB9;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x534A;</strong>&#x3002;</p>
<h3 id="&#x4E8B;&#x540E;&#x7EDF;&#x8BA1;&#x6CD5;&#x7684;&#x5C40;&#x9650;&#x6027;">&#x4E8B;&#x540E;&#x7EDF;&#x8BA1;&#x6CD5;&#x7684;&#x5C40;&#x9650;&#x6027;</h3>
<hr>
<h3 id="1-&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x4F9D;&#x8D56;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;">1. &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x975E;&#x5E38;&#x4F9D;&#x8D56;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;</h3>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x786C;&#x4EF6;&#x7684;&#x4E0D;&#x540C;&#x4F1A;&#x5BF9;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x62FF;&#x540C;&#x6837;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5206;&#x522B;&#x7528; Intel Core i9 &#x5904;&#x7406;&#x5668;&#x548C; Intel Core i3 &#x5904;&#x7406;&#x5668;&#x6765;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;i9 &#x5904;&#x7406;&#x5668;&#x8981;&#x6BD4; i3 &#x5904;&#x7406;&#x5668;&#x6267;&#x884C;&#x7684;&#x901F;&#x5EA6;&#x5FEB;&#x5F88;&#x591A;&#x3002;&#x8FD8;&#x6709;&#xFF0C;&#x6BD4;&#x5982;&#x539F;&#x672C;&#x5728;&#x8FD9;&#x53F0;&#x673A;&#x5668;&#x4E0A; a &#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x901F;&#x5EA6;&#x6BD4; b &#x4EE3;&#x7801;&#x8981;&#x5FEB;&#xFF0C;&#x7B49;&#x6211;&#x4EEC;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x622A;&#x7136;&#x76F8;&#x53CD;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h3 id="2-&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x53D7;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x7684;&#x5F71;&#x54CD;&#x5F88;&#x5927;">2. &#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x53D7;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x7684;&#x5F71;&#x54CD;&#x5F88;&#x5927;</h3>
<p>&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5F85;&#x6392;&#x5E8F;&#x6570;&#x636E;&#x7684;&#x6709;&#x5E8F;&#x5EA6;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x6392;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5DEE;&#x522B;&#x3002;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF0C;&#x90A3;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x5C31;&#x4F1A;&#x975E;&#x5E38;&#x77ED;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x592A;&#x5C0F;&#xFF0C;&#x6D4B;&#x8BD5;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x771F;&#x5B9E;&#x5730;&#x53CD;&#x5E94;&#x7B97;&#x6CD5;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x5C0F;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x6392;&#x5E8F;&#xFF0C;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x53EF;&#x80FD;&#x53CD;&#x5012;&#x4F1A;&#x6BD4;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x8981;&#x5FEB;&#xFF01;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x7528;&#x5177;&#x4F53;&#x7684;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x6765;&#x6D4B;&#x8BD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7C97;&#x7565;&#x5730;&#x4F30;&#x8BA1;&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x7684;&#x65B9;&#x6CD5;</strong>&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x65F6;&#x95F4;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x5927;-o-&#x590D;&#x6742;&#x5EA6;&#x8868;&#x793A;&#x6CD5;">&#x5927; O &#x590D;&#x6742;&#x5EA6;&#x8868;&#x793A;&#x6CD5;</h2>
<p>&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x7C97;&#x7565;&#x5730;&#x8BB2;&#xFF0C;&#x5C31;&#x662F;&#x7B97;&#x6CD5;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7528;&#x201C;&#x8089;&#x773C;&#x201D;&#x5F97;&#x5230;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x5462;&#xFF1F;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x6BB5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6C42; 1,2,3&#x2026;n &#x7684;&#x7D2F;&#x52A0;&#x548C;&#x3002;</p>
<pre><code class="lang-c"> <span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
   <span class="hljs-keyword">int</span> sum = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; i &lt;= n; ++i) {
     sum = sum + i;
   }
   <span class="hljs-keyword">return</span> sum;
 }
</code></pre>
<p>&#x4ECE; CPU &#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x6267;&#x884C;&#x7740;&#x7C7B;&#x4F3C;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;<strong>&#x8BFB;&#x6570;&#x636E;</strong>-<strong>&#x8FD0;&#x7B97;</strong>-<strong>&#x5199;&#x6570;&#x636E;</strong>&#x3002;&#x5C3D;&#x7BA1;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x5BF9;&#x5E94;&#x7684; CPU &#x6267;&#x884C;&#x7684;&#x4E2A;&#x6570;&#x3001;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x7C97;&#x7565;&#x4F30;&#x8BA1;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x4E3A; unit_time&#x3002;</p>
<p>&#x7B2C; 2&#x3001;3 &#x884C;&#x4EE3;&#x7801;&#x5206;&#x522B;&#x9700;&#x8981; 1 &#x4E2A; unit_time &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C; 4&#x3001;5 &#x884C;&#x90FD;&#x8FD0;&#x884C;&#x4E86; n &#x904D;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981; $2n<em> unit_time$ &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x603B;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x5C31;&#x662F; $(2n+2)</em>unit_time$&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;<strong>&#x6240;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4; T(n) &#x4E0E;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6210;&#x6B63;&#x6BD4;</strong>&#x3002;</p>
<p>&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x5206;&#x6790;&#x601D;&#x8DEF;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-c"> <span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
   <span class="hljs-keyword">int</span> sum = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">int</span> j = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; i &lt;= n; ++i) {
     j = <span class="hljs-number">1</span>;
     <span class="hljs-keyword">for</span> (; j &lt;= n; ++j) {
       sum = sum +  i * j;
     }
   }
 }
</code></pre>
<p>&#x4F9D;&#x65E7;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x8BED;&#x53E5;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x662F; unit_time&#x3002;&#x90A3;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x603B;&#x6267;&#x884C;&#x65F6;&#x95F4; T(n) &#x662F;&#x591A;&#x5C11;&#x5462;&#xFF1F;</p>
<p>&#x7B2C; 2&#x3001;3&#x3001;4 &#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6BCF;&#x884C;&#x90FD;&#x9700;&#x8981; 1 &#x4E2A; unit_time &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C; 5&#x3001;6 &#x884C;&#x4EE3;&#x7801;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4E86; n &#x904D;&#xFF0C;&#x9700;&#x8981;$2n<em>unit_time$ &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C; 7&#x3001;8 &#x884C;&#x4EE3;&#x7801;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4E86; $n^2$&#x904D;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981; $2n^{2} </em> unit_time$ &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x603B;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;$T(n) = (2n^2+2n+3)*unit_time$ .</p>
<p>&#x9700;&#x8981; $2n <em> unit_time$ &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C; 7&#x3001;8 &#x884C;&#x4EE3;&#x7801;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4E86; $n^{2}$&#x904D;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981; $2n^{2} </em> unit_time$ &#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x603B;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4; $T(n) = (2n^2+2n+3)*unit_time$&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4E0D;&#x77E5;&#x9053; unit_time &#x7684;&#x5177;&#x4F53;&#x503C;&#xFF0C;&#x4F46;<strong>&#x6240;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4; T(n) &#x4E0E;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x6B21;&#x6570; n &#x6210;&#x6B63;&#x6BD4;</strong>&#x3002;</p>
<p>&#x628A;&#x8FD9;&#x4E2A;&#x89C4;&#x5F8B;&#x603B;&#x7ED3;&#x6210;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;:</p>
<p><span class="katex"><span class="katex-mathml"><math><semantics><mrow><mi>T</mi><mo>(</mo><mi>n</mi><mo>)</mo><mo>=</mo><mi>O</mi><mo>(</mo><mi>f</mi><mo>(</mo><mi>n</mi><mo>)</mo><mo>)</mo></mrow><annotation encoding="application/x-tex"> T(n)=O(f(n)) </annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.75em;"></span><span class="strut bottom" style="height:1em;vertical-align:-0.25em;"></span><span class="base textstyle uncramped"><span class="mord mathit" style="margin-right:0.13889em;">T</span><span class="mopen">(</span><span class="mord mathit">n</span><span class="mclose">)</span><span class="mrel">=</span><span class="mord mathit" style="margin-right:0.02778em;">O</span><span class="mopen">(</span><span class="mord mathit" style="margin-right:0.10764em;">f</span><span class="mopen">(</span><span class="mord mathit">n</span><span class="mclose">)</span><span class="mclose">)</span></span></span></span> T(n) &#x8868;&#x793A;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#xFF1B;n &#x8868;&#x793A;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x7684;&#x5927;&#x5C0F;&#xFF1B;</p>
<p>f(n) &#x8868;&#x793A;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x7684;&#x6B21;&#x6570;&#x603B;&#x548C;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x7528; f(n) &#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x516C;&#x5F0F;&#x4E2D;&#x7684; O&#xFF0C;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4; T(n) &#x4E0E; f(n) &#x8868;&#x8FBE;&#x5F0F;&#x6210;&#x6B63;&#x6BD4;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684; $T(n) = O(2n+2)$&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684; $T(n) = O(2n^2+2n+3)$&#x3002;&#x8FD9;&#x5C31;&#x662F;<strong>&#x5927; O &#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x8868;&#x793A;&#x6CD5;</strong>&#x3002;&#x5927; O &#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5177;&#x4F53;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x771F;&#x6B63;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x8868;&#x793A;<strong>&#x4EE3;&#x7801;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x968F;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x589E;&#x957F;&#x7684;&#x53D8;&#x5316;&#x8D8B;&#x52BF;</strong>&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E5F;&#x53EB;&#x4F5C;<strong>&#x6E10;&#x8FDB;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;asymptotic time complexity&#xFF09;&#xFF0C;&#x7B80;&#x79F0;<strong>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;</p>
<p>&#x5F53; n &#x5F88;&#x5927;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x8C61;&#x6210; 10000&#x3001;100000&#x3002;&#x800C;&#x516C;&#x5F0F;&#x4E2D;&#x7684;&#x4F4E;&#x9636;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x7CFB;&#x6570;&#x4E09;&#x90E8;&#x5206;&#x5E76;&#x4E0D;&#x5DE6;&#x53F3;&#x589E;&#x957F;&#x8D8B;&#x52BF;&#xFF0C;&#x6240;&#x4EE5;&#x90FD;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x91CF;&#x7EA7;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x5927; O &#x8868;&#x793A;&#x6CD5;&#x8868;&#x793A;&#x521A;&#x8BB2;&#x7684;&#x90A3;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BB0;&#x4E3A;&#xFF1A;$T(n) = O(n)&#xFF1B; T(n) = O(n^2)$&#x3002;</p>
<h2 id="&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;">&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;</h2>
<p>&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x5168;&#x79F0;&#x662F;<strong>&#x6E10;&#x8FDB;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF0C;<strong>&#x8868;&#x793A;&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4E0E;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x4E4B;&#x95F4;&#x7684;&#x589E;&#x957F;&#x5173;&#x7CFB;</strong>&#x3002;</p>
<h3 id="&#x4E09;&#x4E2A;&#x6BD4;&#x8F83;&#x5B9E;&#x7528;&#x7684;&#x5206;&#x6790;&#x65B9;&#x6CD5;">&#x4E09;&#x4E2A;&#x6BD4;&#x8F83;&#x5B9E;&#x7528;&#x7684;&#x5206;&#x6790;&#x65B9;&#x6CD5;</h3>
<h4 id="1-&#x53EA;&#x5173;&#x6CE8;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;">1. &#x53EA;&#x5173;&#x6CE8;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;</h4>
<p>&#x5927; O &#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x53EA;&#x662F;&#x8868;&#x793A;&#x4E00;&#x79CD;&#x53D8;&#x5316;&#x8D8B;&#x52BF;&#x3002;&#x901A;&#x5E38;&#x4F1A;&#x5FFD;&#x7565;&#x6389;&#x516C;&#x5F0F;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#x3001;&#x4F4E;&#x9636;&#x3001;&#x7CFB;&#x6570;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x9636;&#x7684;&#x91CF;&#x7EA7;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x5728;&#x5206;&#x6790;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x3001;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x53EA;&#x5173;&#x6CE8;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x90A3;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;</strong>&#x3002;&#x8FD9;&#x6BB5;&#x6838;&#x5FC3;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x6B21;&#x6570;&#x7684; n &#x7684;&#x91CF;&#x7EA7;&#xFF0C;&#x5C31;&#x662F;&#x6574;&#x6BB5;&#x8981;&#x5206;&#x6790;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x4EE5;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E3E;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-c"> <span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
   <span class="hljs-keyword">int</span> sum = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; i &lt;= n; ++i) {
     sum = sum + i;
   }
   <span class="hljs-keyword">return</span> sum;
 }
</code></pre>
<p>&#x5176;&#x4E2D;&#x7B2C; 2&#x3001;3 &#x884C;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x5E38;&#x91CF;&#x7EA7;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x4E0E; n &#x7684;&#x5927;&#x5C0F;&#x65E0;&#x5173;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x5EA6;&#x5E76;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#x662F;&#x7B2C; 4&#x3001;5 &#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5757;&#x4EE3;&#x7801;&#x8981;&#x91CD;&#x70B9;&#x5206;&#x6790;&#x3002;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x4E5F;&#x8BB2;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x88AB;&#x6267;&#x884C;&#x4E86; n &#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(n)&#x3002;</p>
<h4 id="2-&#x52A0;&#x6CD5;&#x6CD5;&#x5219;">2. &#x52A0;&#x6CD5;&#x6CD5;&#x5219;</h4>
<p><strong>&#x603B;&#x590D;&#x6742;&#x5EA6;&#x7B49;&#x4E8E;&#x91CF;&#x7EA7;&#x6700;&#x5927;&#x7684;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x5EA6;</strong></p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
   <span class="hljs-keyword">int</span> sum_1 = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> p = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; p &lt; <span class="hljs-number">100</span>; ++p) {
     sum_1 = sum_1 + p;
   }

   <span class="hljs-keyword">int</span> sum_2 = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> q = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; q &lt; n; ++q) {
     sum_2 = sum_2 + q;
   }

   <span class="hljs-keyword">int</span> sum_3 = <span class="hljs-number">0</span>;
   <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">int</span> j = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; i &lt;= n; ++i) {
     j = <span class="hljs-number">1</span>; 
     <span class="hljs-keyword">for</span> (; j &lt;= n; ++j) {
       sum_3 = sum_3 +  i * j;
     }
   }

   <span class="hljs-keyword">return</span> sum_1 + sum_2 + sum_3;
 }
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x5206;&#x4E3A;&#x4E09;&#x90E8;&#x5206;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x6C42; sum_1&#x3001;sum_2&#x3001;sum_3&#x3002;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x5206;&#x6790;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x5B83;&#x4EEC;&#x653E;&#x5230;&#x4E00;&#x5757;&#x513F;&#xFF0C;&#x518D;&#x53D6;&#x4E00;&#x4E2A;&#x91CF;&#x7EA7;&#x6700;&#x5927;&#x7684;&#x4F5C;&#x4E3A;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4E86; 100 &#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x8DDF; n &#x7684;&#x89C4;&#x6A21;&#x65E0;&#x5173;&#x3002;&#x5373;&#x4FBF;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5FAA;&#x73AF; 10000 &#x6B21;&#x3001;100000 &#x6B21;&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x4E00;&#x4E2A;&#x5DF2;&#x77E5;&#x7684;&#x6570;&#xFF0C;&#x8DDF; n &#x65E0;&#x5173;&#xFF0C;&#x7167;&#x6837;&#x4E5F;&#x662F;&#x5E38;&#x91CF;&#x7EA7;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5F53; n &#x65E0;&#x9650;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C3D;&#x7BA1;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x662F;&#x56DE;&#x5230;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x6982;&#x5FF5;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E0E;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x589E;&#x957F;&#x7684;&#x53D8;&#x5316;&#x8D8B;&#x52BF;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7BA1;&#x5E38;&#x91CF;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x591A;&#x5927;&#x90FD;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x6389;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x672C;&#x8EAB;&#x5BF9;&#x589E;&#x957F;&#x8D8B;&#x52BF;&#x5E76;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6BB5;&#x4EE3;&#x7801;&#x548C;&#x7B2C;&#x4E09;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x522B;&#x662F;$O(n)$ &#x548C; $O(n^2)$&#x3002;</p>
<p>&#x7EFC;&#x5408;&#x8FD9;&#x4E09;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x53D6;&#x5176;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x91CF;&#x7EA7;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x4E3A;$O(n^2)$&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF1A;<strong>&#x603B;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x7B49;&#x4E8E;&#x91CF;&#x7EA7;&#x6700;&#x5927;&#x7684;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;&#x90A3;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x89C4;&#x5F8B;&#x62BD;&#x8C61;&#x6210;&#x516C;&#x5F0F;&#x5C31;&#x662F;&#xFF1A;</p>
<p>&#x5982;&#x679C; $T1(n)=O(f(n))&#xFF0C;T2(n)=O(g(n))$&#xFF1B;&#x90A3;&#x4E48; $T(n)=T1(n)+T2(n)=max(O(f(n))$, $O(g(n))) =O(max(f(n), g(n)))$.</p>
<h4 id="3&#x4E58;&#x6CD5;&#x6CD5;&#x5219;">3.&#x4E58;&#x6CD5;&#x6CD5;&#x5219;</h4>
<p><strong>&#x5D4C;&#x5957;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x7B49;&#x4E8E;&#x5D4C;&#x5957;&#x5185;&#x5916;&#x4EE3;&#x7801;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x4E58;&#x79EF;</strong></p>
<p>&#x5982;&#x679C; $T1(n)=O(f(n))$&#xFF0C;$T2(n)=O(g(n))$&#xFF1B;&#x90A3;&#x4E48; $T(n)=T1(n)<em>T2(n)=O(f(n))</em>O(g(n))=O(f(n)*g(n))$.</p>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5047;&#x8BBE; T1(n) = O(n)&#xFF0C;$T2(n) = O(n^2)$&#xFF0C;&#x5219; $T1(n) <em> T2(n) = O(n^3)$&#x3002;&#x843D;&#x5B9E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x4E58;&#x6CD5;&#x6CD5;&#x5219;&#x770B;&#x6210;&#x662F;<em>*&#x5D4C;&#x5957;&#x5FAA;&#x73AF;</em></em>&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;:</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
   <span class="hljs-keyword">int</span> ret = <span class="hljs-number">0</span>; 
   <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
   <span class="hljs-keyword">for</span> (; i &lt; n; ++i) {
     ret = ret + f(i);
   } 
 } 

 <span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">int</span> sum = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">for</span> (; i &lt; n; ++i) {
    sum = sum + i;
  } 
  <span class="hljs-keyword">return</span> sum;
 }
</code></pre>
<p>&#x5355;&#x72EC;&#x770B; cal() &#x51FD;&#x6570;&#x3002;&#x5047;&#x8BBE; f() &#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x7B2C; 4&#xFF5E;6 &#x884C;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F;&#xFF0C;$T_1(n) = O(n)$&#x3002;&#x4F46; f() &#x51FD;&#x6570;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5B83;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; $T_2(n) = O(n)$&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6574;&#x4E2A; cal() &#x51FD;&#x6570;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F;&#xFF0C;$T(n) = T_1(n) <em> T_2(n) = O(n</em>n) = O(n^2)$&#x3002;</p>
<h3 id="&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;">&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;</h3>
<p>&#x5E38;&#x89C1;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x91CF;&#x7EA7;&#xFF08;&#x6309;&#x6570;&#x91CF;&#x7EA7;&#x9012;&#x589E;&#xFF09;:</p>
<ul>
<li><strong>&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;&#xFF1A;</strong><ul>
<li>&#x5E38;&#x91CF;&#x9636;&#xFF1A;$O(1)$</li>
<li>&#x5BF9;&#x6570;&#x9636;&#xFF1A;$O(log\ n)$</li>
<li>&#x7EBF;&#x6027;&#x9636;&#xFF1A;$O(n)$</li>
<li>&#x7EBF;&#x6027;&#x5BF9;&#x6570;&#x9636;&#xFF1A;$nO(log\ n)$</li>
<li>&#x5E73;&#x65B9;&#x9636;&#xFF1A;$O(n^2)$&#x3001; &#x7ACB;&#x65B9;&#x9636;&#xFF1A;$O(n^3)$&#x3001;&#x2026;&#x2026;&#x3001; K&#x6B21;&#x65B9;&#x9636;&#xFF1A;$O(n^k)$</li>
</ul>
</li>
<li><strong>&#x975E;&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;&#xFF1A;</strong><ul>
<li>&#x6307;&#x6570;&#x9636;&#xFF1A;$O(2^n)$</li>
<li>&#x9636;&#x4E58;&#x9636;&#xFF1A; $O(n!)$</li>
</ul>
</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x7C97;&#x7565;&#x5730;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF0C;<strong>&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;</strong>&#x548C;<strong>&#x975E;&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;</strong>&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x975E;&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;$O(2^n)$ &#x548C; $O(n!)$&#x3002;</p>
<p>&#x5F53;&#x6570;&#x636E;&#x89C4;&#x6A21; n &#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x65F6;&#xFF0C;&#x975E;&#x591A;&#x9879;&#x5F0F;&#x91CF;&#x7EA7;&#x7B97;&#x6CD5;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4F1A;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF0C;&#x6C42;&#x89E3;&#x95EE;&#x9898;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4F1A;&#x65E0;&#x9650;&#x589E;&#x957F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x975E;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x7B97;&#x6CD5;&#x5176;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x6765;&#x770B;&#x51E0;&#x79CD;&#x5E38;&#x89C1;&#x7684;<strong>&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;</p>
<h4 id="1-o11o1"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=c194a9eg-begin-inline-katex1-o1end-inline-katex-" target="_blank"> 1. O(1)1.<em>O</em>(1)</a></h4>
<p>&#x9996;&#x5148;&#x4F60;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;O(1) &#x53EA;&#x662F;&#x5E38;&#x91CF;&#x7EA7;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6307;&#x53EA;&#x6267;&#x884C;&#x4E86;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5373;&#x4FBF;&#x6709; 3 &#x884C;&#xFF0C;&#x5B83;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x662F; O(1)&#xFF0C;&#x800C;&#x4E0D;&#x662F; O(3)&#x3002;</p>
<pre><code class="lang-c"> <span class="hljs-keyword">int</span> i = <span class="hljs-number">8</span>;
 <span class="hljs-keyword">int</span> j = <span class="hljs-number">6</span>;
 <span class="hljs-keyword">int</span> sum = i + j;Copy to clipboardErrorCopied
</code></pre>
<p>&#x53EA;&#x8981;&#x4EE3;&#x7801;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x4E0D;&#x968F; n &#x7684;&#x589E;&#x5927;&#x800C;&#x589E;&#x957F;&#xFF0C;&#x8FD9;&#x6837;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x6211;&#x4EEC;&#x90FD;&#x8BB0;&#x4F5C; O(1)&#x3002;&#x6216;&#x8005;&#x8BF4;&#xFF0C;<strong>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x8981;&#x7B97;&#x6CD5;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#x3001;&#x9012;&#x5F52;&#x8BED;&#x53E5;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x884C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x662F;&#x39F;(1)</strong>&#x3002;</p>
<h4 id="2-ologn&#x3001;onlogn2ologn&#x3001;onlogn"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=c194a9eg-begin-inline-katex2-ologn&#x3001;onlognend-inline-katex-" target="_blank">2. O(logn)&#x3001;O(nlogn)2.<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#x3001;<em>O</em>(<em>n<strong>l</strong>o<strong>g</strong>n</em>)</a></h4>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-c"> i=<span class="hljs-number">1</span>;
 <span class="hljs-keyword">while</span> (i &lt;= n)  {
   i = i * <span class="hljs-number">2</span>;
 }Copy to clipboardErrorCopied
</code></pre>
<p>&#x7B2C;&#x4E09;&#x884C;&#x4EE3;&#x7801;&#x662F;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x6B21;&#x6570;&#x6700;&#x591A;&#x7684;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x8BA1;&#x7B97;&#x51FA;&#x8FD9;&#x884C;&#x4EE3;&#x7801;&#x88AB;&#x6267;&#x884C;&#x4E86;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53D8;&#x91CF; i &#x7684;&#x53D6;&#x503C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7B49;&#x6BD4;&#x6570;&#x5217;&#x3002;&#x5982;&#x679C;&#x628A;&#x5B83;&#x5217;&#x51FA;&#x6765;&#xFF1A;</p>
<p>2^{0} \quad 2^{1} \quad 2^{2} \cdots 2^{k} \cdots 2^{x}=n202122&#x22EF;2<em>k</em>&#x22EF;2<em>x</em>=<em>n</em></p>
<p>&#x901A;&#x8FC7; 2^x=n2<em>x</em>=<em>n</em> &#x5F97; x=log_2n<em>x</em>=<em>l<strong>o</strong>g</em>2<em>n</em>&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(log_2n)<em>O</em>(<em>l<strong>o</strong>g</em>2<em>n</em>)&#x3002;</p>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-c"> i=<span class="hljs-number">1</span>;
 <span class="hljs-keyword">while</span> (i &lt;= n)  {
   i = i * <span class="hljs-number">3</span>;
 }Copy to clipboardErrorCopied
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E3A; O(log_3n)<em>O</em>(<em>l<strong>o</strong>g</em>3<em>n</em>)&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x5BF9;&#x6570;&#x9636;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x8BB0;&#x4E3A; O(log\ n)<em>O</em>(<em>l<strong>o</strong>g</em> <em>n</em>)&#x3002;</p>
<p>log_3n= log_3 2 <em> log_2 n</em>l<strong>o</strong>g<em>3</em>n<em>=</em>l<strong>o</strong>g<em>32&#x2217;</em>l<strong>o</strong>g<em>2</em>n<em>&#xFF0C;&#x6240;&#x4EE5; O(log_3 n) = O(C </em> log_2 n)<em>O</em>(<em>l<strong>o</strong>g</em>3<em>n</em>)=<em>O</em>(<em>C</em>&#x2217;<em>l<strong>o</strong>g</em>2<em>n</em>)&#xFF0C;&#x5176;&#x4E2D; C=log_32<em>C</em>=<em>l<strong>o</strong>g</em>32 &#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5BF9;&#x6570;&#x9636;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5FFD;&#x7565;&#x5BF9;&#x6570;&#x7684;&#x201C;&#x5E95;&#x201D;&#xFF0C;&#x7EDF;&#x4E00;&#x8868;&#x793A;&#x4E3A; O(logn)<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; O(logn)<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#xFF0C;&#x5FAA;&#x73AF;&#x6267;&#x884C; n &#x904D;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(logn)<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#x4E86;&#x3002;</p>
<p>&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x662F; O(nlogn)<em>O</em>(<em>n<strong>l</strong>o<strong>g</strong>n</em>)&#x3002;</p>
<h4 id="3-omn&#x3001;omn3omn&#x3001;om&#x2217;n"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=c194a9eg-begin-inline-katex3-omn&#x3001;omnend-inline-katex-" target="_blank">3. O(m+n)&#x3001;O(m<em>n)3.</em>O<em>(</em>m<em>+</em>n<em>)&#x3001;</em>O<em>(</em>m<em>&#x2217;</em>n*)</a></h4>
<p>&#x8FD9;&#x79CD;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x5EA6;<strong>&#x7531;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x89C4;&#x6A21;</strong>&#x6765;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x5148;&#x770B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">cal</span><span class="hljs-params">(<span class="hljs-keyword">int</span> m, <span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">int</span> sum_1 = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">for</span> (; i &lt; m; ++i) {
    sum_1 = sum_1 + i;
  }

  <span class="hljs-keyword">int</span> sum_2 = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span> j = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">for</span> (; j &lt; n; ++j) {
    sum_2 = sum_2 + j;
  }

  <span class="hljs-keyword">return</span> sum_1 + sum_2;
}Copy to clipboardErrorCopied
</code></pre>
<p>m &#x548C; n &#x662F;&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x89C4;&#x6A21;&#xFF0C;&#x65E0;&#x6CD5;&#x4E8B;&#x5148;&#x8BC4;&#x4F30; m &#x548C; n &#x8C01;&#x7684;&#x91CF;&#x7EA7;&#x5927;&#xFF0C;&#x65E0;&#x6CD5;&#x5FFD;&#x7565;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(m+n)&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x52A0;&#x6CD5;&#x89C4;&#x5219;&#x4E3A;&#xFF1A;T_1(m) + T_2(n) = O(f(m) + g(n))<em>T</em>1(<em>m</em>)+<em>T</em>2(<em>n</em>)=<em>O</em>(<em>f</em>(<em>m</em>)+<em>g</em>(<em>n</em>))&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E58;&#x6CD5;&#x6CD5;&#x5219;&#x7EE7;&#x7EED;&#x6709;&#x6548;&#xFF1A;T_1(m)<em>T_2(n) = O(f(m) </em> f(n))<em>T</em>1(<em>m</em>)&#x2217;<em>T</em>2(<em>n</em>)=<em>O</em>(<em>f</em>(<em>m</em>)&#x2217;<em>f</em>(<em>n</em>))&#x3002;</p>
<h2 id="&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;" target="_blank">&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;</a></h2>
<p>&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5168;&#x79F0;&#x5C31;&#x662F;<strong>&#x6E10;&#x8FDB;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;asymptotic space complexity&#xFF09;&#xFF0C;<strong>&#x8868;&#x793A;&#x7B97;&#x6CD5;&#x7684;&#x989D;&#x5916;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E0E;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x4E4B;&#x95F4;&#x7684;&#x589E;&#x957F;&#x5173;&#x7CFB;</strong>&#x3002;</p>
<p>&#x4E3E;&#x4E2A;&#x5F31;&#x667A;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">print</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span>[] a = <span class="hljs-keyword">new</span> <span class="hljs-keyword">int</span>[n];
  <span class="hljs-keyword">for</span> (i; i &lt;n; ++i) {
    a[i] = i * i;
  }

  <span class="hljs-keyword">for</span> (i = n<span class="hljs-number">-1</span>; i &gt;= <span class="hljs-number">0</span>; --i) {
    print out a[i]
  }
}Copy to clipboardErrorCopied
</code></pre>
<p>&#x7B2C; 2 &#x884C;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x7533;&#x8BF7;&#x4E86;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#x5B58;&#x50A8;&#x53D8;&#x91CF; i&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x662F;&#x5E38;&#x91CF;&#x9636;&#x7684;&#xFF0C;&#x8DDF;&#x6570;&#x636E;&#x89C4;&#x6A21; n &#x6CA1;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x3002;</p>
<p>&#x7B2C; 3 &#x884C;&#x7533;&#x8BF7;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A; n &#x7684; int &#x7C7B;&#x578B;&#x6570;&#x7EC4;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x6CA1;&#x6709;&#x5360;&#x7528;&#x66F4;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(n)&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(1)&#x3001;O(n)&#x3001;O(n^2)<em>O</em>(1)&#x3001;<em>O</em>(<em>n</em>)&#x3001;<em>O</em>(<em>n</em>2)&#xFF0C;&#x50CF; O(logn)&#x3001;O(nlogn)<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#x3001;<em>O</em>(<em>n<strong>l</strong>o<strong>g</strong>n</em>) &#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x6570;&#x9636;&#x590D;&#x6742;&#x5EA6;&#x5E73;&#x65F6;&#x90FD;&#x7528;&#x4E0D;&#x5230;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x6BD4;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x8981;&#x7B80;&#x5355;&#x5F88;&#x591A;&#x3002;</p>
<h2 id="&#x6E10;&#x8FDB;&#x590D;&#x6742;&#x5EA6;&#x5C0F;&#x7ED3;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x6E10;&#x8FDB;&#x590D;&#x6742;&#x5EA6;&#x5C0F;&#x7ED3;" target="_blank">&#x6E10;&#x8FDB;&#x590D;&#x6742;&#x5EA6;&#x5C0F;&#x7ED3;</a></h2>
<p>&#x6E10;&#x8FDB;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5305;&#x62EC;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x7528;&#x6765;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E0E;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x4E4B;&#x95F4;&#x7684;&#x589E;&#x957F;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x7C97;&#x7565;&#x5730;&#x8868;&#x793A;&#xFF0C;&#x8D8A;&#x9AD8;&#x9636;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x6267;&#x884C;&#x6548;&#x7387;&#x8D8A;&#x4F4E;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x4ECE;&#x4F4E;&#x9636;&#x5230;&#x9AD8;&#x9636;&#x6709;&#xFF1A;</p>
<p>O(1)&#x3001;O(logn)&#x3001;O(n)&#x3001;O(nlogn)&#x3001;O(n^2)<em>O</em>(1)&#x3001;<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#x3001;<em>O</em>(<em>n</em>)&#x3001;<em>O</em>(<em>n<strong>l</strong>o<strong>g</strong>n</em>)&#x3001;<em>O</em>(<em>n</em>2)&#x3002;</p>
<p><a href="https://datastructure.xiaoxiaoming.xyz/imgs/1570684986266.png" data-lightbox="65229546-1dea-40a8-9fee-06685b012844" data-title="1570684986266" target="_blank"><img src="https://datastructure.xiaoxiaoming.xyz/imgs/1570684986266.png" alt="1570684986266"></a></p>
<p>&#x6E10;&#x8FDB;&#x65F6;&#x95F4;&#xFF0C;&#x6E10;&#x8FDB;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x4E0E;&#x662F;&#x5BBF;&#x4E3B;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x7684;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x6216;&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x81F4;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x5982;&#x4F55;&#x3002;</p>
<p>&#x7B97;&#x6CD5;1&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n)<em>O</em>(<em>n</em>)&#xFF0C;&#x7B97;&#x6CD5;2&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;O(logn)<em>O</em>(<em>l<strong>o</strong>g**n</em>)&#xFF0C;&#x80FD;&#x7ACB;&#x523B;&#x5C31;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x6548;&#x7387;&#x201D;&#x4E0A;&#x7684;&#x611F;&#x6027;&#x8BA4;&#x8BC6;&#x3002;</p>
<p>&#x6E10;&#x8FDB;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x6A21;&#x578B;&#xFF0C;&#x53EA;&#x80FD;&#x63D0;&#x4F9B;&#x7ED9;&#x7C97;&#x7565;&#x7684;&#x4F30;&#x8BA1;&#x5206;&#x6790;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x65AD;&#x5B9A;&#x5C31;&#x89C9;&#x5F97;O(logN)&#x7684;&#x7B97;&#x6CD5;&#x4E00;&#x5B9A;&#x4F18;&#x4E8E;O(n), &#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5BBF;&#x4E3B;&#x73AF;&#x5883;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E0A;&#x9762;&#x53EF;&#x80FD;&#x771F;&#x6B63;&#x7684;&#x6027;&#x80FD;&#x4F1A;&#x4E0D;&#x540C;&#xFF0C;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x8FDB;&#x800C;&#x8FDB;&#x884C;&#x4E00;&#x5B9A;&#x7684;&#x6027;&#x80FD;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x540C;&#x4E00;&#x6279;&#x624B;&#x673A;&#x4E0A;(&#x540C;&#x6837;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x7CFB;&#x7EDF;&#x7B49;&#x7B49;)&#x8FDB;&#x884C;&#x6A2A;&#x5411;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FDB;&#x800C;&#x9009;&#x62E9;&#x9002;&#x5408;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E0B;&#x7684;&#x6700;&#x6709;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x6E10;&#x8FDB;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x4E0E;&#x6027;&#x80FD;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x5E76;&#x4E0D;&#x51B2;&#x7A81;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x4F4E;&#x9636;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7A0B;&#x5E8F;&#x6709;&#x6781;&#x5927;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4F1A;&#x4F18;&#x4E8E;&#x4E00;&#x4E2A;&#x9AD8;&#x9636;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7A0B;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x65F6;&#x523B;&#x5173;&#x5FC3;&#x7406;&#x8BBA;&#x65F6;&#x95F4;&#xFF0C;&#x7A7A;&#x95F4;&#x5EA6;&#x6A21;&#x578B;&#x662F;&#x6709;&#x52A9;&#x4E8E;&#x4EA7;&#x51FA;&#x6548;&#x7387;&#x9AD8;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x6E10;&#x8FDB;&#x5F0F;&#x65F6;&#x95F4;&#xFF0C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7C97;&#x7565;&#x7684;&#x5206;&#x6790;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x4E0D;&#x4F1A;&#x6D6A;&#x8D39;&#x592A;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x5728;&#x7F16;&#x7A0B;&#x65F6;&#xFF0C;&#x8981;&#x5177;&#x6709;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x7684;&#x601D;&#x7EF4;&#x3002;</p>
<h1 id="&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;" target="_blank">&#x56DB;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;</a></h1>
<p><strong>&#x6700;&#x597D;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;best case time complexity&#xFF09;</p>
<p><strong>&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;worst case time complexity&#xFF09;</p>
<p><strong>&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;average case time complexity&#xFF09;</p>
<p><strong>&#x5747;&#x644A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#xFF08;amortized time complexity&#xFF09;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x65E0;&#x5E8F;&#x7684;&#x6570;&#x7EC4;&#xFF08;array&#xFF09;&#x4E2D;&#xFF0C;&#x67E5;&#x627E;&#x53D8;&#x91CF; x &#x51FA;&#x73B0;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x5C31;&#x8FD4;&#x56DE; -1&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x662F; O(n)&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;n &#x4EE3;&#x8868;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x67E5;&#x627E;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x90FD;&#x628A;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x90FD;&#x904D;&#x5386;&#x4E00;&#x904D;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x53EF;&#x80FD;&#x4E2D;&#x9014;&#x627E;&#x5230;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x7ED3;&#x675F;&#x5FAA;&#x73AF;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-comment">// n &#x8868;&#x793A;&#x6570;&#x7EC4; array &#x7684;&#x957F;&#x5EA6;</span>
<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">find</span><span class="hljs-params">(<span class="hljs-keyword">int</span>[] <span class="hljs-built_in">array</span>, <span class="hljs-keyword">int</span> n, <span class="hljs-keyword">int</span> x)</span> </span>{
  <span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span> pos = <span class="hljs-number">-1</span>;
  <span class="hljs-keyword">for</span> (; i &lt; n; ++i) {
    <span class="hljs-keyword">if</span> (<span class="hljs-built_in">array</span>[i] == x) {
       pos = i;
       <span class="hljs-keyword">break</span>;
    }
  }
  <span class="hljs-keyword">return</span> pos;
}Copy to clipboardErrorCopied
</code></pre>
<p>&#x8981;&#x67E5;&#x627E;&#x7684;&#x53D8;&#x91CF; x &#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5728;&#x6570;&#x7EC4;&#x7684;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6570;&#x7EC4;&#x4E2D;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x6B63;&#x597D;&#x662F;&#x8981;&#x67E5;&#x627E;&#x7684;&#x53D8;&#x91CF; x&#xFF0C;&#x90A3;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F; O(1)&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x6570;&#x7EC4;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x53D8;&#x91CF; x&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x628A;&#x6574;&#x4E2A;&#x6570;&#x7EC4;&#x90FD;&#x904D;&#x5386;&#x4E00;&#x904D;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x6210;&#x4E86; O(n)&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<h1 id="&#x6700;&#x597D;&#x3001;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x6700;&#x597D;&#x3001;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;" target="_blank">&#x6700;&#x597D;&#x3001;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</a></h1>
<p>&#x4E3A;&#x4E86;&#x8868;&#x793A;&#x4EE3;&#x7801;&#x5728;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5F15;&#x5165;&#x6700;&#x597D;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3001;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p><strong>&#x6700;&#x597D;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x6700;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;</p>
<p><strong>&#x6700;&#x574F;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;</p>
<h2 id="&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;" target="_blank">&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</a></h2>
<p>&#x5E73;&#x5747;&#x60C5;&#x51B5;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x53EF;&#x7B80;&#x79F0;&#x4E3A;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x53EF;&#x4EE5;&#x53EB;<strong>&#x52A0;&#x6743;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x6216;&#x8005;<strong>&#x671F;&#x671B;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</strong>&#x3002;</p>
<p>&#x5F15;&#x5165;&#x6982;&#x7387;&#x4E4B;&#x540E;&#xFF0C;&#x524D;&#x9762;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x52A0;&#x6743;&#x5E73;&#x5747;&#x503C;&#x4E3A;\frac{3n+1}{4}43<em>n</em>+1 &#x3002;&#x7528;&#x5927; O &#x8868;&#x793A;&#x6CD5;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x53BB;&#x6389;&#x7CFB;&#x6570;&#x548C;&#x5E38;&#x91CF;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x52A0;&#x6743;&#x5E73;&#x5747;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4ECD;&#x7136;&#x662F; O(n)&#x3002;</p>
<p>&#x53EA;&#x6709;&#x540C;&#x4E00;&#x5757;&#x4EE3;&#x7801;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x6709;&#x91CF;&#x7EA7;&#x7684;&#x5DEE;&#x8DDD;&#xFF0C;&#x624D;&#x4F1A;&#x4F7F;&#x7528;&#x6700;&#x597D;&#x6700;&#x5DEE;&#x5E73;&#x5747;&#x4E09;&#x79CD;&#x590D;&#x6742;&#x5EA6;&#x8868;&#x793A;&#x6CD5;&#x6765;&#x533A;&#x5206;&#x3002;</p>
<h2 id="&#x5747;&#x644A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;"><a href="https://datastructure.xiaoxiaoming.xyz/#/01.&#x5165;&#x95E8;&#x7BC7;?id=&#x5747;&#x644A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;" target="_blank">&#x5747;&#x644A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;</a></h2>
<p>&#x5747;&#x644A;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6; &#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#xFF0C;&#x644A;&#x8FD8;&#x5206;&#x6790;&#xFF08;&#x6216;&#x8005;&#x53EB;&#x5E73;&#x644A;&#x5206;&#x6790;&#xFF09;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; yxm666.github.io/mybook 2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2020-01-17 13:15:55
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style> <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 书籍介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Array.html" class="navigation navigation-next " aria-label="Next page: 02. 数组">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"typora-copy-images-to":"ipic","title":"入门篇","level":"2.1","depth":1,"next":{"title":"02. 数组","level":"3.1","depth":1,"path":"Array.md","ref":"Array.md","articles":[]},"previous":{"title":"书籍介绍","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["flexible-alerts","-search","search-pro","pageview-count","simple-page-toc","tbfed-pagefooter","popup","sharing-plus","klipse","flexible-alerts","pageview-count","auto-scroll-table","lightbox","advanced-emoji","katex","disqus","back-to-top-button","chapter-fold","-lunr","splitter","github","github-buttons","code"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy yxm666.github.io/mybook 2019","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"disqus":{"useIdentifier":false,"shortName":"gitbookuse"},"github":{"url":"https://github.com/yxm666"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"auto-scroll-table":{},"popup":{},"code":{"copyButtons":true},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"lightbox":{"jquery":true,"sameUuid":false},"back-to-top-button":{},"pageview-count":{},"github-buttons":{"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"callout","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"}},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"instapaper":false,"twitter":true,"vk":false,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"数据结构与算法.md","mtime":"2020-01-17T05:15:55.446Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-31T09:32:44.183Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-auto-scroll-table/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

