
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>04. 递归 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-auto-scroll-table/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Stack.html" />
    
    
    <link rel="prev" href="LinkList.html" />
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    书籍介绍
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">入门篇</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    入门篇
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基础篇</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="Array.html">
            
                <a href="Array.html">
            
                    
                    02. 数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="LinkList.html">
            
                <a href="LinkList.html">
            
                    
                    03. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.3" data-path="递归.html">
            
                <a href="递归.html">
            
                    
                    04. 递归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.4" data-path="Stack.html">
            
                <a href="Stack.html">
            
                    
                    05. 栈
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.5" data-path="queue.html">
            
                <a href="queue.html">
            
                    
                    06. 队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.6" data-path="sort.html">
            
                <a href="sort.html">
            
                    
                    07. 排序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.7" data-path="二分查找.html">
            
                <a href="二分查找.html">
            
                    
                    08. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.8" data-path="跳表.html">
            
                <a href="跳表.html">
            
                    
                    09.跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.9" data-path="散列表.html">
            
                <a href="散列表.html">
            
                    
                    10.散列表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.10" data-path="哈希算法.html">
            
                <a href="哈希算法.html">
            
                    
                    11.哈希算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.11" data-path="二叉树.html">
            
                <a href="二叉树.html">
            
                    
                    12.二叉树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.12" data-path="红黑树.md">
            
                <span>
            
                    
                    13.红黑树
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.13" data-path="二叉堆.html">
            
                <a href="二叉堆.html">
            
                    
                    14.二叉堆与优先队列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.14" data-path="图.html">
            
                <a href="图.html">
            
                    
                    15.图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.15" data-path="DFS and BFS.html">
            
                <a href="DFS and BFS.html">
            
                    
                    16.深度优先遍历 和 广度优先遍历
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >04. 递归</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5982;&#x4F55;&#x7406;&#x89E3;&#x9012;&#x5F52;">&#x5982;&#x4F55;&#x7406;&#x89E3;&#x201C;&#x9012;&#x5F52;&#x201D;</h1>
<p>&#x9012;&#x5F52;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x3001;&#x7B80;&#x6D01;&#x7684;&#x7F16;&#x7801;&#x6280;&#x5DE7;&#xFF0C;&#x4E0D;&#x8FC7;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x4E5F;&#x6BD4;&#x8F83;&#x96BE;&#x5199;&#x3001;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x7ED5;&#x8FDB;&#x53BB;&#xFF0C;&#x6B63;&#x786E;&#x59FF;&#x52BF;&#x662F;&#x5199;&#x51FA;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x627E;&#x51FA;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7FFB;&#x8BD1;&#x6210;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x4E5F;&#x6BD4;&#x8F83;&#x96BE;&#x5199;&#x3001;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x628A;&#x81EA;&#x5DF1;&#x7ED5;&#x8FDB;&#x53BB;&#xFF0C;&#x6B63;&#x786E;&#x59FF;&#x52BF;&#x662F;&#x5199;&#x51FA;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x627E;&#x51FA;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7FFB;&#x8BD1;&#x6210;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x867D;&#x7136;&#x7B80;&#x6D01;&#x9AD8;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5F0A;&#x7AEF;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5806;&#x6808;&#x6EA2;&#x51FA;&#x3001;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x3001;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8017;&#x65F6;&#x591A;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x9AD8;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x63A7;&#x5236;&#x597D;&#x8FD9;&#x4E9B;&#x526F;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x7684;&#x7F16;&#x7801;&#x5B9E;&#x73B0;&#x90FD;&#x8981;&#x7528;&#x5230;&#x9012;&#x5F52;&#xFF0C;&#x6BD4;&#x5982; DFS &#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x3001;&#x524D;&#x4E2D;&#x540E;&#x5E8F;&#x4E8C;&#x53C9;&#x6811;&#x904D;&#x5386;&#x7B49;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x751F;&#x6D3B;&#x4E2D;&#x7528;&#x5230;&#x9012;&#x5F52;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<blockquote>
<p>&#x5468;&#x672B;&#x4F60;&#x5E26;&#x7740;&#x5973;&#x670B;&#x53CB;&#x53BB;&#x7535;&#x5F71;&#x9662;&#x770B;&#x7535;&#x5F71;&#xFF0C;&#x5973;&#x670B;&#x53CB;&#x95EE;&#x4F60;&#xFF0C;&#x54B1;&#x4EEC;&#x73B0;&#x5728;&#x5750;&#x5728;&#x7B2C;&#x51E0;&#x6392;&#x554A;&#xFF1F;&#x7535;&#x5F71;&#x9662;&#x91CC;&#x9762;&#x592A;&#x9ED1;&#x4E86;&#xFF0C;&#x770B;&#x4E0D;&#x6E05;&#xFF0C;&#x6CA1;&#x6CD5;&#x6570;&#xFF0C;&#x73B0;&#x5728;&#x4F60;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x4E8E;&#x662F;&#x4F60;&#x5C31;&#x95EE;&#x524D;&#x9762;&#x4E00;&#x6392;&#x7684;&#x4EBA;&#x4ED6;&#x662F;&#x7B2C;&#x51E0;&#x6392;&#xFF0C;&#x4F60;&#x60F3;&#x53EA;&#x8981;&#x5728;&#x4ED6;&#x7684;&#x6570;&#x5B57;&#x4E0A;&#x52A0;&#x4E00;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x4EBA;&#x4E5F;&#x770B;&#x4E0D;&#x6E05;&#x554A;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4E5F;&#x95EE;&#x4ED6;&#x524D;&#x9762;&#x7684;&#x4EBA;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x4E00;&#x6392;&#x4E00;&#x6392;&#x5F80;&#x524D;&#x95EE;&#xFF0C;&#x76F4;&#x5230;&#x95EE;&#x5230;&#x7B2C;&#x4E00;&#x6392;&#x7684;&#x4EBA;&#xFF0C;&#x8BF4;&#x6211;&#x5728;&#x7B2C;&#x4E00;&#x6392;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8FD9;&#x6837;&#x4E00;&#x6392;&#x4E00;&#x6392;&#x518D;&#x628A;&#x6570;&#x5B57;&#x4F20;&#x56DE;&#x6765;&#x3002;&#x76F4;&#x5230;&#x4F60;&#x524D;&#x9762;&#x7684;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#x4ED6;&#x5728;&#x54EA;&#x4E00;&#x6392;&#xFF0C;&#x4E8E;&#x662F;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#x7B54;&#x6848;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6807;&#x51C6;&#x7684;&#x9012;&#x5F52;&#x6C42;&#x89E3;&#x95EE;&#x9898;&#x7684;&#x5206;&#x89E3;&#x8FC7;&#x7A0B;&#xFF0C;&#x53BB;&#x7684;&#x8FC7;&#x7A0B;&#x53EB;&#x201C;&#x9012;&#x201D;&#xFF0C;&#x56DE;&#x6765;&#x7684;&#x8FC7;&#x7A0B;&#x53EB;&#x201C;&#x5F52;&#x201D;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x9012;&#x5F52;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x6765;&#x8868;&#x793A;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x5C06;&#x5B83;&#x8868;&#x793A;&#x51FA;&#x6765;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code>f(n)=f(n-1)+1 &#x5176;&#x4E2D;&#xFF0C;f(1)=1
</code></pre><p>f(n) &#x8868;&#x793A;&#x4F60;&#x60F3;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#xFF0C;f(n-1) &#x8868;&#x793A;&#x524D;&#x9762;&#x4E00;&#x6392;&#x6240;&#x5728;&#x7684;&#x6392;&#x6570;&#xFF0C;f(1)=1 &#x8868;&#x793A;&#x7B2C;&#x4E00;&#x6392;&#x7684;&#x4EBA;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x7B2C;&#x4E00;&#x6392;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x5B83;&#x6539;&#x4E3A;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">1</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  <span class="hljs-keyword">return</span> f(n<span class="hljs-number">-1</span>) + <span class="hljs-number">1</span>;
}
</code></pre>
<h2 id="&#x9012;&#x5F52;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x4E09;&#x4E2A;&#x6761;&#x4EF6;"><a href="https://datastructure.xiaoxiaoming.xyz/#/06.&#x9012;&#x5F52;?id=&#x9012;&#x5F52;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x4E09;&#x4E2A;&#x6761;&#x4EF6;" target="_blank">&#x9012;&#x5F52;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x4E09;&#x4E2A;&#x6761;&#x4EF6;</a></h2>
<p>&#x6EE1;&#x8DB3;&#x4E09;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x7528;&#x9012;&#x5F52;&#x6765;&#x89E3;&#x51B3;&#xFF1A;</p>
<p><strong>1. &#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x51E0;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x7684;&#x89E3;</strong></p>
<p>&#x5B50;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x66F4;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x524D;&#x9762;&#x8BB2;&#x7684;&#x7535;&#x5F71;&#x9662;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x201C;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x201C;&#x524D;&#x4E00;&#x6392;&#x7684;&#x4EBA;&#x5728;&#x54EA;&#x4E00;&#x6392;&#x201D;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5B50;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>2. &#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0E;&#x5206;&#x89E3;&#x4E4B;&#x540E;&#x7684;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x9664;&#x4E86;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x4E0D;&#x540C;&#xFF0C;&#x6C42;&#x89E3;&#x601D;&#x8DEF;&#x5B8C;&#x5168;&#x4E00;&#x6837;</strong></p>
<p>&#x6BD4;&#x5982;&#x7535;&#x5F71;&#x9662;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6C42;&#x89E3;&#x201C;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#x201D;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x548C;&#x524D;&#x9762;&#x4E00;&#x6392;&#x4EBA;&#x6C42;&#x89E3;&#x201C;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#x201D;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x662F;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p><strong>3. &#x5B58;&#x5728;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;</strong></p>
<p>&#x628A;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x628A;&#x5B50;&#x95EE;&#x9898;&#x518D;&#x5206;&#x89E3;&#x4E3A;&#x5B50;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x5206;&#x89E3;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0D;&#x80FD;&#x5B58;&#x5728;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6709;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x7535;&#x5F71;&#x9662;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7B2C;&#x4E00;&#x6392;&#x7684;&#x4EBA;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x7EE7;&#x7EED;&#x8BE2;&#x95EE;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x54EA;&#x4E00;&#x6392;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; f(1)=1&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x9012;&#x5F52;&#x7684;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#xFF1F;">&#x5982;&#x4F55;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#xFF1F;</h2>
<p>&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;<strong>&#x5199;&#x51FA;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x627E;&#x5230;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;</strong>&#x3002;</p>
<p>&#x5047;&#x5982;&#x8FD9;&#x91CC;&#x6709; n &#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x6BCF;&#x6B21;&#x4F60;&#x53EF;&#x4EE5;&#x8DE8; 1 &#x4E2A;&#x53F0;&#x9636;&#x6216;&#x8005; 2 &#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x8BF7;&#x95EE;&#x8D70;&#x8FD9; n &#x4E2A;&#x53F0;&#x9636;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x8D70;&#x6CD5;&#xFF1F;&#x5982;&#x679C;&#x6709; 7 &#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5; 2&#xFF0C;2&#xFF0C;2&#xFF0C;1 &#x8FD9;&#x6837;&#x5B50;&#x4E0A;&#x53BB;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5; 1&#xFF0C;2&#xFF0C;1&#xFF0C;1&#xFF0C;2 &#x8FD9;&#x6837;&#x5B50;&#x4E0A;&#x53BB;&#xFF0C;&#x603B;&#x4E4B;&#x8D70;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x90A3;&#x5982;&#x4F55;&#x7528;&#x7F16;&#x7A0B;&#x6C42;&#x5F97;&#x603B;&#x5171;&#x6709;&#x591A;&#x5C11;&#x79CD;&#x8D70;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7B2C;&#x4E00;&#x6B65;&#x7684;&#x8D70;&#x6CD5;&#x628A;&#x6240;&#x6709;&#x8D70;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF0C;&#x7B2C;&#x4E00;&#x7C7B;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#x8D70;&#x4E86; 1 &#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x53E6;&#x4E00;&#x7C7B;&#x662F;&#x7B2C;&#x4E00;&#x6B65;&#x8D70;&#x4E86; 2 &#x4E2A;&#x53F0;&#x9636;&#x3002;&#x6240;&#x4EE5; n &#x4E2A;&#x53F0;&#x9636;&#x7684;&#x8D70;&#x6CD5;&#x5C31;&#x7B49;&#x4E8E;&#x5148;&#x8D70; 1 &#x9636;&#x540E;n-1 &#x4E2A;&#x53F0;&#x9636;&#x7684;&#x8D70;&#x6CD5;&#xFF0C;&#x52A0;&#x4E0A;&#x5148;&#x8D70; 2 &#x9636;&#x540E;n-2 &#x4E2A;&#x53F0;&#x9636;&#x7684;&#x8D70;&#x6CD5;&#x3002;&#x7528;&#x516C;&#x5F0F;&#x8868;&#x793A;&#x5C31;&#x662F;&#xFF1A;</p>
<pre><code class="lang-c">f(n) = f(n<span class="hljs-number">-1</span>)+f(n<span class="hljs-number">-2</span>)
</code></pre>
<p>&#x518D;&#x6765;&#x770B;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;:</p>
<p>&#x5F53;&#x6709;&#x4E00;&#x4E2A;&#x53F0;&#x9636;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x7EE7;&#x7EED;&#x9012;&#x5F52;&#xFF0C;&#x5C31;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x8D70;&#x6CD5;&#x3002;&#x6240;&#x4EE5; f(1)=1&#x3002;</p>
<p>&#x518D;&#x7528; n=2&#xFF0C;n=3 &#x8FD9;&#x6837;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x8BD5;&#x9A8C;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x662F;&#x5426;&#x8DB3;&#x591F;&#xFF1A;</p>
<p>n=2 &#x65F6;&#xFF0C;f(2)=f(1)+f(0)&#x3002;&#x5982;&#x679C;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x53EA;&#x6709;&#x4E00;&#x4E2A; f(1)=1&#xFF0C;&#x90A3; f(2) &#x5C31;&#x65E0;&#x6CD5;&#x6C42;&#x89E3;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x9664;&#x4E86; f(1)=1 &#x8FD9;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x6709; f(0)=1&#xFF0C;&#x8868;&#x793A;&#x8D70; 0 &#x4E2A;&#x53F0;&#x9636;&#x6709;&#x4E00;&#x79CD;&#x8D70;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6837;&#x5B50;&#x770B;&#x8D77;&#x6765;&#x53C8;&#x4E0D;&#x7B26;&#x5408;&#x6B63;&#x5E38;&#x7684;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x3002;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x628A; f(2)=2 &#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#xFF0C;&#x8868;&#x793A;&#x8D70; 2 &#x4E2A;&#x53F0;&#x9636;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x8D70;&#x6CD5;&#xFF0C;&#x4E00;&#x6B65;&#x8D70;&#x5B8C;&#x6216;&#x8005;&#x5206;&#x4E24;&#x6B65;&#x6765;&#x8D70;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x5C31;&#x662F; f(1)=1&#xFF0C;f(2)=2&#x3002;&#x8FD9;&#x65F6;&#x518D;&#x62FF; n=3&#xFF0C;n=4 &#x6765;&#x9A8C;&#x8BC1;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x662F;&#x5426;&#x8DB3;&#x591F;&#x5E76;&#x4E14;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x628A;&#x9012;&#x5F52;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x548C;&#x521A;&#x521A;&#x5F97;&#x5230;&#x7684;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x653E;&#x5230;&#x4E00;&#x8D77;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code class="lang-c">f(<span class="hljs-number">1</span>) = <span class="hljs-number">1</span>;
f(<span class="hljs-number">2</span>) = <span class="hljs-number">2</span>;
f(n) = f(n<span class="hljs-number">-1</span>)+f(n<span class="hljs-number">-2</span>)
</code></pre>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x8F6C;&#x5316;&#x6210;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x5C31;&#x7B80;&#x5355;&#x591A;&#x4E86;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">1</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">2</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">2</span>;
  <span class="hljs-keyword">return</span> f(n<span class="hljs-number">-1</span>) + f(n<span class="hljs-number">-2</span>);
}
</code></pre>
<p><strong>&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x952E;&#x5C31;&#x662F;&#x627E;&#x5230;&#x5982;&#x4F55;&#x5C06;&#x5927;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x4E3A;&#x5C0F;&#x95EE;&#x9898;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x5E76;&#x4E14;&#x57FA;&#x4E8E;&#x6B64;&#x5199;&#x51FA;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x63A8;&#x6572;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x548C;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x7FFB;&#x8BD1;&#x6210;&#x4EE3;&#x7801;</strong>&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4EBA;&#x8111;&#x51E0;&#x4E4E;&#x6CA1;&#x529E;&#x6CD5;&#x628A;&#x6574;&#x4E2A;&#x201C;&#x9012;&#x201D;&#x548C;&#x201C;&#x5F52;&#x201D;&#x7684;&#x8FC7;&#x7A0B;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x90FD;&#x60F3;&#x6E05;&#x695A;&#x3002;</p>
<p><strong>&#x6B63;&#x786E;&#x7684;&#x7406;&#x89E3;&#x9012;&#x5F52;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF1A;</strong></p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x95EE;&#x9898; A &#x53EF;&#x4EE5;&#x5206;&#x89E3;&#x4E3A;&#x82E5;&#x5E72;&#x5B50;&#x95EE;&#x9898; B&#x3001;C&#x3001;D&#xFF0C;&#x5148;&#x5047;&#x8BBE;&#x5B50;&#x95EE;&#x9898; B&#x3001;C&#x3001;D &#x5DF2;&#x7ECF;&#x89E3;&#x51B3;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x601D;&#x8003;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x95EE;&#x9898; A&#x3002;&#x53EA;&#x9700;&#x8981;&#x601D;&#x8003;&#x95EE;&#x9898; A &#x4E0E;&#x5B50;&#x95EE;&#x9898; B&#x3001;C&#x3001;D &#x4E24;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x8981;&#x4E00;&#x5C42;&#x4E00;&#x5C42;&#x5F80;&#x4E0B;&#x601D;&#x8003;&#x5B50;&#x95EE;&#x9898;&#x4E0E;&#x5B50;&#x5B50;&#x95EE;&#x9898;&#xFF0C;&#x5B50;&#x5B50;&#x95EE;&#x9898;&#x4E0E;&#x5B50;&#x5B50;&#x5B50;&#x95EE;&#x9898;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5C4F;&#x853D;&#x6389;&#x9012;&#x5F52;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x6837;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x5C31;&#x7B80;&#x5355;&#x591A;&#x4E86;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;<strong>&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x952E;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x9047;&#x5230;&#x9012;&#x5F52;&#xFF0C;&#x5C31;&#x628A;&#x5B83;&#x62BD;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#xFF0C;&#x4E0D;&#x7528;&#x60F3;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x8C03;&#x7528;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x7528;&#x4EBA;&#x8111;&#x53BB;&#x5206;&#x89E3;&#x9012;&#x5F52;&#x7684;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;</strong>&#x3002;</p>
<h2 id="&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x8981;&#x8B66;&#x60D5;&#x5806;&#x6808;&#x6EA2;&#x51FA;">&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x8981;&#x8B66;&#x60D5;&#x5806;&#x6808;&#x6EA2;&#x51FA;</h2>
<p>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4F1A;&#x4F7F;&#x7528;&#x6808;&#x6765;&#x4FDD;&#x5B58;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x3002;&#x6BCF;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x90FD;&#x4F1A;&#x5C06;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x5C01;&#x88C5;&#x4E3A;&#x6808;&#x5E27;&#x538B;&#x5165;&#x5185;&#x5B58;&#x6808;&#xFF0C;&#x7B49;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6210;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x624D;&#x51FA;&#x6808;&#x3002;&#x5982;&#x679C;&#x9012;&#x5F52;&#x6C42;&#x89E3;&#x7684;&#x6570;&#x636E;&#x89C4;&#x6A21;&#x5F88;&#x5927;&#xFF0C;&#x8C03;&#x7528;&#x5C42;&#x6B21;&#x5F88;&#x6DF1;&#xFF0C;&#x4E00;&#x76F4;&#x538B;&#x5165;&#x6808;&#xFF0C;<strong>&#x5C31;&#x4F1A;&#x6709;&#x5806;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x98CE;&#x9669;</strong>&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x8BB2;&#x7684;&#x7535;&#x5F71;&#x9662;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x7CFB;&#x7EDF;&#x6808;&#x6216;&#x8005; JVM &#x5806;&#x6808;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A; 1KB&#xFF0C;&#x5728;&#x6C42;&#x89E3; f(19999) &#x65F6;&#x4FBF;&#x4F1A;&#x51FA;&#x73B0;&#x5982;&#x4E0B;&#x5806;&#x6808;&#x62A5;&#x9519;&#xFF1A;</p>
<pre><code class="lang-java">Exception in thread <span class="hljs-string">&quot;main&quot;</span> java.lang.StackOverflowErrorCopy to clipboardErrorCopied
</code></pre>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x5806;&#x6808;&#x6EA2;&#x51FA;&#x5462;&#xFF1F;</p>
<p>&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x9650;&#x5236;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x7684;&#x6700;&#x5927;&#x6DF1;&#x5EA6;&#xFF0C;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x6DF1;&#x5EA6;&#xFF08;&#x6BD4;&#x5982; 1000&#xFF09;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x62A5;&#x9519;&#x3002;</p>
<p>&#x7535;&#x5F71;&#x9662;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x6539;&#x9020;&#x6210;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x5B50;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5806;&#x6808;&#x6EA2;&#x51FA;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-comment">// &#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x8868;&#x793A;&#x9012;&#x5F52;&#x7684;&#x6DF1;&#x5EA6;&#x3002;</span>
<span class="hljs-keyword">int</span> depth = <span class="hljs-number">0</span>;

<span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  ++depth&#xFF1B;
  <span class="hljs-keyword">if</span> (depth &gt; <span class="hljs-number">1000</span>) <span class="hljs-keyword">throw</span> exception;

  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">1</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  <span class="hljs-keyword">return</span> f(n<span class="hljs-number">-1</span>) + <span class="hljs-number">1</span>;
}
</code></pre>
<p>&#x4F46;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x5927;&#x5141;&#x8BB8;&#x7684;&#x9012;&#x5F52;&#x6DF1;&#x5EA6;&#x8DDF;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x5269;&#x4F59;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x6709;&#x5173;&#xFF0C;&#x4E8B;&#x5148;&#x65E0;&#x6CD5;&#x8BA1;&#x7B97;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x65F6;&#x8BA1;&#x7B97;&#xFF0C;&#x4EE3;&#x7801;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x6700;&#x5927;&#x6DF1;&#x5EA6;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x6BD4;&#x5982; 10&#x3001;50&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x5B9E;&#x7528;&#x3002;</p>
<h2 id="&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x8981;&#x8B66;&#x60D5;&#x91CD;&#x590D;&#x8BA1;&#x7B97;"><a href="https://datastructure.xiaoxiaoming.xyz/#/06.&#x9012;&#x5F52;?id=&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x8981;&#x8B66;&#x60D5;&#x91CD;&#x590D;&#x8BA1;&#x7B97;" target="_blank">&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x8981;&#x8B66;&#x60D5;&#x91CD;&#x590D;&#x8BA1;&#x7B97;</a></h2>
<p>&#x521A;&#x624D;&#x7B2C;&#x4E8C;&#x4E2A;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x4F8B;&#x5B50;&#x628A;&#x6574;&#x4E2A;&#x9012;&#x5F52;&#x8FC7;&#x7A0B;&#x5206;&#x89E3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<p><a href="https://datastructure.xiaoxiaoming.xyz/imgs/2/1570433907877.png" data-lightbox="649baf2a-4518-4c95-93a3-a15376216029" data-title="1570433907877" target="_blank"><img src="https://datastructure.xiaoxiaoming.xyz/imgs/2/1570433907877.png" alt="1570433907877"></a></p>
<p>&#x4ECE;&#x56FE;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8981;&#x8BA1;&#x7B97; f(5)&#xFF0C;&#x9700;&#x8981;&#x5148;&#x8BA1;&#x7B97; f(4) &#x548C; f(3)&#xFF0C;&#x800C;&#x8BA1;&#x7B97; f(4) &#x8FD8;&#x9700;&#x8981;&#x8BA1;&#x7B97; f(3)&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;f(3) &#x5C31;&#x88AB;&#x8BA1;&#x7B97;&#x4E86;&#x5F88;&#x591A;&#x6B21;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x6BD4;&#x5982;&#x6563;&#x5217;&#x8868;&#xFF09;&#x6765;&#x4FDD;&#x5B58;&#x5DF2;&#x7ECF;&#x6C42;&#x89E3;&#x8FC7;&#x7684; f(k)&#x3002;&#x5F53;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x5230; f(k) &#x65F6;&#xFF0C;&#x5148;&#x770B;&#x4E0B;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x6C42;&#x89E3;&#x8FC7;&#x4E86;&#x3002;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x4ECE;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x53D6;&#x503C;&#x8FD4;&#x56DE;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x3002;</p>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">1</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">2</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">2</span>;

  <span class="hljs-comment">// hasSolvedList &#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x4E00;&#x4E2A; Map&#xFF0C;key &#x662F; n&#xFF0C;value &#x662F; f(n)</span>
  <span class="hljs-keyword">if</span> (hasSolvedList.containsKey(n)) {
    <span class="hljs-keyword">return</span> hasSovledList.get(n);
  }

  <span class="hljs-keyword">int</span> ret = f(n-<span class="hljs-number">1</span>) + f(n-<span class="hljs-number">2</span>);
  hasSovledList.put(n, ret);
  <span class="hljs-keyword">return</span> ret;
}
</code></pre>
<p>&#x5728;&#x65F6;&#x95F4;&#x6548;&#x7387;&#x4E0A;&#xFF0C;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x91CC;&#x591A;&#x4E86;&#x5F88;&#x591A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x6570;&#x91CF;&#x8F83;&#x5927;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x79EF;&#x805A;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x89C2;&#x7684;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x3002;&#x5728;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#x5C31;&#x4F1A;&#x5728;&#x5185;&#x5B58;&#x6808;&#x4E2D;&#x4FDD;&#x5B58;&#x4E00;&#x6B21;&#x73B0;&#x573A;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5206;&#x6790;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x989D;&#x5916;&#x8003;&#x8651;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x6BD4;&#x5982;&#x7535;&#x5F71;&#x9662;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#xFF0C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F; O(n)&#x3002;</p>
<h2 id="&#x5C06;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x6539;&#x5199;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#x4EE3;&#x7801;"><a href="https://datastructure.xiaoxiaoming.xyz/#/06.&#x9012;&#x5F52;?id=&#x5C06;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x6539;&#x5199;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#x4EE3;&#x7801;" target="_blank">&#x5C06;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x6539;&#x5199;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#x4EE3;&#x7801;</a></h2>
<p>&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x8868;&#x8FBE;&#x529B;&#x5F88;&#x5F3A;&#xFF0C;&#x5199;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x662F;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x9AD8;&#x3001;&#x6709;&#x5806;&#x6808;&#x6EA2;&#x51FA;&#x7684;&#x98CE;&#x9669;&#x3001;&#x5B58;&#x5728;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x3001;&#x8FC7;&#x591A;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4F1A;&#x8017;&#x65F6;&#x8F83;&#x591A;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5E94;&#x5F53;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x5C3D;&#x91CF;&#x628A;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x6539;&#x5199;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x53EA;&#x770B; f(x) =f(x-1)+1 &#x8FD9;&#x4E2A;&#x9012;&#x63A8;&#x516C;&#x5F0F;&#x3002;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6539;&#x5199;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">int</span> ret = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">2</span>; i &lt;= n; ++i) {
    ret = ret + <span class="hljs-number">1</span>;
  }
  <span class="hljs-keyword">return</span> ret;
}
</code></pre>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x4E5F;&#x53EF;&#x4EE5;&#x6539;&#x4E3A;&#x975E;&#x9012;&#x5F52;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">int</span> <span class="hljs-title">f</span><span class="hljs-params">(<span class="hljs-keyword">int</span> n)</span> </span>{
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">1</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">1</span>;
  <span class="hljs-keyword">if</span> (n == <span class="hljs-number">2</span>) <span class="hljs-keyword">return</span> <span class="hljs-number">2</span>;

  <span class="hljs-keyword">int</span> ret = <span class="hljs-number">0</span>;
  <span class="hljs-keyword">int</span> pre = <span class="hljs-number">2</span>;
  <span class="hljs-keyword">int</span> prepre = <span class="hljs-number">1</span>;
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">3</span>; i &lt;= n; ++i) {
    ret = pre + prepre;
    prepre = pre;
    pre = ret;
  }
  <span class="hljs-keyword">return</span> ret;
}
</code></pre>
<p>&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x90FD;&#x53EF;&#x4EE5;&#x6539;&#x4E3A;&#x8FD9;&#x79CD;<strong>&#x8FED;&#x4EE3;&#x5FAA;&#x73AF;</strong>&#x7684;&#x975E;&#x9012;&#x5F52;&#x5199;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x56E0;&#x4E3A;&#x9012;&#x5F52;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x501F;&#x52A9;&#x6808;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x5728;&#x5185;&#x5B58;&#x5806;&#x4E0A;&#x5B9E;&#x73B0;&#x6808;&#xFF0C;&#x624B;&#x52A8;&#x6A21;&#x62DF;&#x5165;&#x6808;&#x3001;&#x51FA;&#x6808;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#x4EFB;&#x4F55;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x90FD;&#x53EF;&#x4EE5;&#x6539;&#x5199;&#x6210;&#x770B;&#x4E0A;&#x53BB;&#x4E0D;&#x662F;&#x9012;&#x5F52;&#x4EE3;&#x7801;&#x7684;&#x6837;&#x5B50;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x8DEF;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5C06;&#x9012;&#x5F52;&#x6539;&#x4E3A;&#x4E86;&#x201C;&#x624B;&#x52A8;&#x201D;&#x9012;&#x5F52;&#xFF0C;&#x5F92;&#x589E;&#x4E86;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<h2 id="&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;"><strong>&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;</strong></h2>
<p>&#x6590;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;&#xFF08;Fibonacci sequence&#xFF09;&#xFF0C;&#x53C8;&#x79F0;&#x9EC4;&#x91D1;&#x5206;&#x5272;&#x6570;&#x5217;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6570;&#x5217;&#xFF1A;0&#x3001;1&#x3001;1&#x3001;2&#x3001;3&#x3001;5&#x3001;8&#x3001;13&#x3001;21&#x3001;34&#x3001;&#x2026;&#x2026;&#x3002;</p>
<p>&#x5728;&#x6570;&#x5B66;&#x4E0A;&#xFF0C;&#x8D39;&#x6CE2;&#x90A3;&#x5951;&#x6570;&#x5217;&#x662F;&#x4EE5;&#x9012;&#x5F52;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code>F(0)=0(n=0)
F(1)=1(n=1)
F(n)=F(n-1)+F(n-2) (n&gt;=2&#xFF0C;n&#x2208;N*)
</code></pre><p>python&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">fib</span><span class="hljs-params">(n)</span>:</span>
    <span class="hljs-keyword">if</span> n &lt;= <span class="hljs-number">1</span>:
        <span class="hljs-keyword">return</span> n
    <span class="hljs-keyword">return</span> fib(n - <span class="hljs-number">1</span>) + fib(n - <span class="hljs-number">2</span>)
</code></pre>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; yxm666.github.io/mybook 2019 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2020-01-21 00:01:19
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style> <link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"> <script>     window.klipse_settings = {         selector: ".language-klipse, .lang-eval-clojure",         selector_eval_js: ".lang-eval-js",         selector_eval_python_client: ".lang-eval-python",         selector_eval_php: ".lang-eval-php",         selector_eval_scheme: ".lang-eval-scheme",         selector_eval_ruby: ".lang-eval-ruby",         selector_reagent: ".lang-reagent",        selector_google_charts: ".lang-google-chart",        selector_es2017: ".lang-eval-es2017",        selector_jsx: ".lang-eval-jsx",        selector_transpile_jsx: ".lang-transpile-jsx",        selector_render_jsx: ".lang-render-jsx",        selector_react: ".lang-react",        selector_eval_markdown: ".lang-render-markdown",        selector_eval_lambdaway: ".lang-render-lambdaway",        selector_eval_cpp: ".lang-eval-cpp",        selector_eval_html: ".lang-render-html",        selector_sql: ".lang-eval-sql",        selector_brainfuck: "lang-eval-brainfuck",        selector_js: ".lang-transpile-cljs"    }; </script> <script src="https://storage.googleapis.com/app.klipse.tech/plugin/js/klipse_plugin.js"></script>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="LinkList.html" class="navigation navigation-prev " aria-label="Previous page: 03. 链表">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Stack.html" class="navigation navigation-next " aria-label="Next page: 05. 栈">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"04. 递归","level":"3.3","depth":1,"next":{"title":"05. 栈","level":"3.4","depth":1,"path":"Stack.md","ref":"Stack.md","articles":[]},"previous":{"title":"03. 链表","level":"3.2","depth":1,"path":"LinkList.md","ref":"LinkList.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["flexible-alerts","-search","search-pro","pageview-count","simple-page-toc","tbfed-pagefooter","popup","sharing-plus","klipse","flexible-alerts","pageview-count","auto-scroll-table","lightbox","advanced-emoji","katex","disqus","back-to-top-button","chapter-fold","-lunr","splitter","github","github-buttons","code"],"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy yxm666.github.io/mybook 2019","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"disqus":{"useIdentifier":false,"shortName":"gitbookuse"},"github":{"url":"https://github.com/yxm666"},"simple-page-toc":{"maxDepth":3,"skipFirstH1":true},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"auto-scroll-table":{},"popup":{},"code":{"copyButtons":true},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"lightbox":{"jquery":true,"sameUuid":false},"back-to-top-button":{},"pageview-count":{},"github-buttons":{"buttons":[{"user":"yxm666","repo":"mybook","type":"star","size":"small","count":true}]},"flexible-alerts":{"danger":{"className":"danger","icon":"fa fa-ban","label":"Attention"},"note":{"className":"info","icon":"fa fa-info-circle","label":"Note"},"style":"callout","tip":{"className":"tip","icon":"fa fa-lightbulb-o","label":"Tip"},"warning":{"className":"warning","icon":"fa fa-exclamation-triangle","label":"Warning"}},"klipse":{"myConfigKey":"it's the default value"},"advanced-emoji":{"embedEmojis":false},"sharing":{"qq":true,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":true,"facebook":true,"weibo":true,"instapaper":false,"twitter":true,"vk":false,"pocket":true,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"递归.md","mtime":"2020-01-20T16:01:19.911Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-31T09:32:44.183Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-auto-scroll-table/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

